{"question": "Hi , I am hearing today the 3 rd death cases of young Sri Lankan (less than 30 age) in hamad hospital this week, As I am not aware the reason for these death within a week, I am just fear on this, can anybody advice on me where can i check the reason for this..", "username": "akramwahid"}
{"question": "Hi All ,   I have chroninc sinustis after consultation Doctor recommend me to do a surgery which is schedule next week if anybody has an expereicned to any sort of surgery perform in qatar please share ur valueble inputs ,so that i can take steps .   Please advise !", "username": "shaikh abdul rauf"}
{"question": "Hi! I am looking for a part time cooking maid for Indian cooking. It would also work well if she cleans the house (2BHK) as well (as we are currently using agency part time cleaners). Location: West Bay. Please let us know for any contacts/ leads. Thank you in advance.", "username": "yashgupta25"}
{"comments": [{"comment": "An offer letter is not a valid document. You must sign the contract. Ask your company for a copy", "username": "britexpat", "commentId": "comment-7420171"}], "question": "", "username": "umair abbasi"}
{"comments": [{"comment": "Dear All, You have any information regarding the aforementioned issues, please lets me know Thank You", "username": "alisshahid", "commentId": "comment-7421826"}, {"comment": "I am ready to exchange for 300 riyals right now. if interested call me 77854910", "username": "afrozeahmedk", "commentId": "comment-7420831"}, {"comment": "If any one knows where i can changes this Indian currency. please let me know", "username": "alisshahid", "commentId": "comment-7420821"}, {"comment": "You should have exchanged it the moment you brought it to Qatar. Now just cross your fingers and wait!", "username": "fgnhgn", "commentId": "comment-7420621"}, {"comment": "Ya give to ur frds who travelling india,, afferent changing they can transfer u v are also doing same no other go.. or wait for any infm from Indian embassy", "username": "iswariya", "commentId": "comment-7420571"}, {"comment": "Be patient .. You will be happy soon", "username": "muad-db", "commentId": "comment-7420556"}, {"comment": "Exchanges will start accepting after 2-3 days and until 31 Dec 2016. Alternatively you can send it with someone to India if they are travelling before 31 Dec to deposit in any local bank or to exchange in bank counter.", "username": "Syed01@yahoo.com", "commentId": "comment-7420451"}, {"comment": "This issue is with all the Indian Expats. Wait for some Official announcement from Indian Embassy.", "username": "ppanjwani_34", "commentId": "comment-7420446"}], "question": "Dear All, Actually I am from India and I am having (7 x 1000) 7000.00 IRS, as you aware yesterday Indian Government Announcement 500 & 1000 IRS Currency not vaild and they are issuance new currency. yesterday i tried to exchange Indian rupees but all the exchange are not accepting. Please let me know where i can change my Indian rupees to Qatar Riyal Please advise Thank You", "username": "alisshahid"}
{"comments": [{"comment": "Dear Sir, Out of topic reply. We are sure you must be knowing this information that Certified Information Systems Auditor (CISA) certification will not considered as valid education as per Qatar government regulation as it is considered as distance mode of education. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7420481"}], "question": "Heyo..!! Anybody from Qatar Appearing For CISA ( Certified Information System Auditor ) Examinations from Doha Qatar this December.. ?", "username": "jujarmerchant@gmail.com"}
{"comments": [{"comment": "You need to visit the following departments to clear your travel ban. Capitol Police Dept, Prosecution Dept and finally Ministry of Interior Directorate of Public Security. Only person can help you is who has already done this recently.", "username": "Syed01@yahoo.com", "commentId": "comment-7420041"}], "question": "Dear Qlers, Some months back I had a bounced cheque due to the fact that I lost my job,I was called by police so I told them I will try and pay in a weeks time,luckily I got this money paid cash and gave me receipt which I presented to the police. They told me the case was closed but after some few months I got a message from metrash that I was issued a travel ban by public prosecution I was just so confused I call back my The police they said all is fine so I forgot about it. Today I got an SMS from metrash stating A judge has been issued for the case: 7601/2016 Capital Security Dept.- Cheques division. Please refer to Verdict Execution Department in MOI. Has any had any of such encounter please share.Am still go go to Moi. What is the procedure for uplifting a travel ban after all outstanding amounts have been paid with receipts at hand? Thanks.", "username": "Eddie-Mega"}
{"question": "Does anybody having any idea about SUNBEAM Kindergarten AL SADD, Am having interview there for the post of Speech therapist. Does anybody knows the salary scale for speech therapist in sunbeam..??? And also about the management..?? Thanks Adila Majeed", "username": "adilamajeed"}
{"comments": [{"comment": "If you release it , then it will head home", "username": "britexpat", "commentId": "comment-7421391"}], "question": "Dear QL Members. I got a Racing Pigeon in my Parking area. I want to give it back to his owner. Pigeon has a Ring in his leg with a unique number. Can I reach to his owner through this ring number? Please advice.  Thanks in advance.", "username": "islamic studies"}
{"comments": [{"comment": "Try Naseem Al-Rabeeh Medical Center on C Ring road near Gulf Cinema telephone numbers 4465 2121, 4465 5151.", "username": "acchabaccha", "commentId": "comment-7420892"}], "question": "", "username": "Safwan Butt"}
{"question": "Im an Electrical Engineer , my UPDA (c grade ) got expired in Nov2015. I could nt renew the licence since i was out of qatar from (Nov 2015 to June 2016) . Now my certificate got deleted from the system.I checked already the mmup office near city centre but told the same, required to write the exam again. Any thoughts??", "username": "safin989"}
{"question": "", "username": "Eddie-Mega"}
{"comments": [{"comment": "I used to use Yupp Tv online to watch serials. It is still accessible.", "username": "AaronDz", "commentId": "comment-7421876"}, {"comment": "hi anyone can give advice on it", "username": "aswanika", "commentId": "comment-7421696"}], "question": "Hello friends can we get Yupp Tv in qatar, if any one knows please advise me. i am south india, so i m looking for south indian channels, because my building has ristriction to keep dish on roof top.", "username": "aswanika"}
{"comments": [{"comment": "Thank you very much for such a clear and informative answer! Very helpful :)", "username": "Targett", "commentId": "comment-7421626"}, {"comment": "Dear Targett, You need to provide your husband passport copy & QID copy to company PRO to prepare the below documents and this documents needs to be prepared by company PRO. 1) Transfer Application Form 2) NOC in Arabic (No objection to transfer your visa to another sponsor) 3) Attach company documents (CR copy, Computer Card Copy, etc.,). 4) PRO needs to take all the above documents to Immigration to verify the company signature, your husband can accompany to complete his signature to verify at the same time to avoid him going back again later time. Once documentation verification is completed, your husband need to attach rest of documents like (Labor Contract, NOC/Salary Certificate from his current sponsor, 6 months bank statement, attested qualification certificate, attested marriage certificate, attested tenancy contract) and submit at Immigration for approval and track online the application status. Once it is approved make the payment and change the QID from work RP to family RP (Not allowed to work unless you process labor contract and labor card separately after getting approval from Ministry of Labor - again this will be PRO's job if you are going to continue working)", "username": "Syed01@yahoo.com", "commentId": "comment-7421526"}], "question": "Hello.  I am trying to change my sponsorship from my company to my husband. I know I need a NOC for that from my company. But can someone give me guidance on how that NOC should be written? A sample? What must I include? Thanks!", "username": "Targett"}
{"comments": [{"comment": "yes of course i'm Holding a QID", "username": "vaseemmd.724", "commentId": "comment-7422171"}, {"comment": "You will need to have a valid QID and have to take a test", "username": "britexpat", "commentId": "comment-7421746"}], "question": "Hi I'm holding QID of an engineer visa & got my NOC from the company i work and i have my Indian Driving licence, can someone please guide me with the present process for application of driving licence and i would to know few details like: How much is the fee? Do i need to go for Classes? if yes, any kind of short term classes are available like 10 days, 15 days or any ? And if possible please help me with complete process Thanks for your time.", "username": "vaseemmd.724"}
{"question": "HI, DOES ANYONE KNOWS WHERE I CAN FIND HUB CENTRIC RINGS IN DOHA RATHER THAN MAKING ONE IN INDUSTRIAL AREA? OR AT LEAST SOMEONE WHO KNOWS HOW TO MEASURE THE HUB GAP? THIS RING IS USED TO CLEAR VIBRATION ON STEERING WHEELS IF WE ARE USING AN ALTERED ALLOY WHEELS FOR OUR VEHICLES. KINDLY HELP", "username": "tasli"}
{"question": "Dear all, Please help me with law regarding operating a school bus here in Qatar. 1) is it allow to operate without a Nany. Specially they are transporting kids below 7 years. 2) is they can demand the small kids to go to near by junction to get transportation. Even all other schools are operating there school buses infront of vills/ Appartment.", "username": "yousif123"}
{"comments": [{"comment": "You need to complete minimum one year for transferring visa to another sponsor. Meanwhile, since your employer is agreeing for 6 months secondment contract, please proceed with it until you complete one year and after you can transfer the visa permanently to new employer. It is good if your new employer agrees to take you on board with 6 months temporary contract since most of the companies does not prefer this.", "username": "Syed01@yahoo.com", "commentId": "comment-7421891"}], "question": "Hi Everyone, I would like to ask regarding on my situation. My job contract here is unlimited contract and now i worked for 7 mos. already. My employer informed me to find another job because they plan to stop the work operation. Now I have a new job offer from new employer but My previous employer give only temporary transfer because they cannot be issued NOC coz it requires and must be at least 1 year working. My questions, is there's any problem I might encountered on processing of my documents in MOI due to I work 7 mos only and having temporary transfer? Please give me an advice. Looking forward and greatly appreciated your kind response.", "username": "lum30"}
{"comments": [{"comment": "Dear Sir, If the company doesn't pay then it will automatically cancel. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7421961"}], "question": "Dear Friends I need advice.I would like to ask something about my situation.A company did not send a visa to my brother last 2.5 months.When I check in MOI Website there are showing Ready to Print.Pls Check Attached file. that visa expiry date is 3-Dec-16. so my question is this Visa is Automatically Cancel in Imigration Dept or not. after expiring a Visa I bring to him on Visit Visa or another Company Visa. I am doing right? or is there any another option? Thanks in advance", "username": "suhail9176"}
{"question": "", "username": "Gunsmane"}
{"comments": [{"comment": "Normally the Company will have more than one Authorized Signatory; and if so ask the other person to issue another NOC. If not, the other option is to request the Sponsor to accompany you to the immigration dept.", "username": "Mohamed Ihsan1", "commentId": "comment-7417491"}, {"comment": "Get him to sign another one or ask your PRO to approach the immigration office and talk to them", "username": "britexpat", "commentId": "comment-7417481"}], "question": "Hi, I am a srilankan came to qatar on a  3 month visa and found a job, I got NOC latter from the sponsor of 3 months visa and handed over to new company to apply for me sponsor change and new visa, the immigration rejected it saying the signature for the first sponsor is little different, yes there is a slight different in the signature, as What I aware first sponsor has difficult in making same signature, so what is alternative to solve this problem", "username": "akramwahid"}
{"question": "Hello QL members, I applied for UPDA and got a message the next day for submitting my documents but the problem is I am very far from the MMUP office and I have no conveyance to reach there as I cannot find a taxi. Can I submit my documents next day after receiving message from BALADIYA. Kindly help. Thanks in advance.", "username": "abdulbari075"}
{"question": "Hi guyz, Can you help me locate a car seat covers shop. I woud like to put on seat covers and laminate the flooring.  I know Crazy signal shops but i heard on inferior quality job from them, but i dont know. Ready made covers for specific model would be best, if i can get for Patrol 2016 (on internet its not there). Any specific name of shop with location will be real help. Thanks for reading.", "username": "silenceisgood"}
{"comments": [{"comment": "If his salary is only 3k , then how exactly is he going to return 9k to his boss, neighbour and countryman within three months and still live, send money home and find the extra 1k to get the bike ?", "username": "britexpat", "commentId": "comment-7418341"}, {"comment": "Borrow 3K each from your boss, neighbour and a countryman ............... then all you need is 1K that you can spare ............. promise them that you will return in the 3 months time ..............", "username": "Molten Metal", "commentId": "comment-7418301"}, {"comment": "thank you all for you advices and time x3", "username": "aliseem", "commentId": "comment-7417921"}, {"comment": "I would suggest maybe renting the bike when required. You may get loan to buy the bike, but you also have to maintain it. Given your salary, you will be undertaking a risky investment.", "username": "britexpat", "commentId": "comment-7417736"}, {"comment": "No Loan will cause you any pain if you utilize it wisely", "username": "Lucky Luciano", "commentId": "comment-7417691"}, {"comment": "You should be asking for a loan on that salary and nor should you be given one. Save up and then buy the bike. Do not take a risk", "username": "omarm88", "commentId": "comment-7417686"}, {"comment": "You can get the loan from Doha Bank with a salary of QAR 3000", "username": "Lucky Luciano", "commentId": "comment-7417676"}, {"comment": "Stay away from loans Ali my pal .. It will only cause pain", "username": "muad-db", "commentId": "comment-7417561"}], "question": "Hey guys, I need your advice and guidance.. Am trying to get a loan but unfortunately my salary is about 3000qr and my bank refuses to give me so . i've contacted the QNB as well but the same thing goes for them; i know that loans are the worst thing a person can get involved in, but am really bored here in qatar and am trying to get a dirt bike so ill be looking at about 10000 qr or more and i dont have that much money.. Do you know any financial institutes that could provide such service .. ? I've heard there are some but but am not sure if they are trustworthy! Thank you ", "username": "aliseem"}
{"comments": [{"comment": "I think its started in DPS, BPS, visit the schools you can come to know.", "username": "aswanika", "commentId": "comment-7417801"}], "question": "", "username": "abdul shefeer"}
{"comments": [{"comment": "Qatar airways is the only choice for direct flight, but the prices are higher. So I kept it as a last option.", "username": "knkr", "commentId": "comment-7418951"}, {"comment": "qatar airways is best for them straight from chennai,, mostly accompany u need to search na difficult,, but i m gng to india", "username": "iswariya", "commentId": "comment-7418576"}], "question": "My parents are travelling from India to Doha. Anybody coming from Coimbatore, Trichy, Chennai or Bangalore pls. inform. I wish to accompany my parents with some one. Thanks in advance.", "username": "knkr"}
{"comments": [{"comment": "I suggest Sunday and you should apply 4 - 5 days before, otherwise your ad will go too last. As per my experience and I am an HR, I would like to prefer Sunday, because if I have any requirement I am always checking Sunday classifieds, because in Sunday classifieds can get many contacts.", "username": "Q-Recruitment", "commentId": "comment-7418651"}, {"comment": "Thanks molten metal and Achabaccha Let me try my luck once again!", "username": "Muhammad Afnan 1994", "commentId": "comment-7418316"}, {"comment": "Go for Wed. because the HR staff is most busy on a Sunday ............ so better choose Wed. ...... wish you good luck & joys .............. ..... !", "username": "Molten Metal", "commentId": "comment-7418286"}, {"comment": "What if the ad is in Gulftimes newspaper...?", "username": "Muhammad Afnan 1994", "commentId": "comment-7417941"}, {"comment": "Sunday.", "username": "acchabaccha", "commentId": "comment-7417931"}], "question": "Hello QL, I want to know whether Wednesday or Sunday is the better to post job seeking ad", "username": "Muhammad Afnan 1994"}
{"comments": [{"comment": "Dear Sir, Kindly Contact UNIVERSAL INTERNATIONAL RELOCATION, we have complete door to door services, for further inquiry feel free to contact us on +974 5549 5238, or mail us tanweer@universalintlr.com", "username": "Tanweer Ata", "commentId": "comment-7420461"}, {"comment": "Use Express Mail Service (EMS) of Q-Post. They are will be the most competitive.", "username": "acchabaccha", "commentId": "comment-7417326"}, {"comment": "Cheep Charlies provide lousy service.", "username": "Lucky Luciano", "commentId": "comment-7417251"}], "question": "I want to courier a box ( Size 150x20x70cm & Weight 17-20 kgs) from Dubai to Doha. Who are the cheapest Cargo Services available here in Qatar?", "username": "danudmw"}
{"question": "I'm Electronic & communication Engineer but working as Electrical Engineer in private concern. Question will be Electrical or Electronics ?? Please advise Do u have any questions related to MMUP please share to this mail jeeva.naveen@gmail.com Regards, Naveen- 50543497", "username": "jeeva.naveen"}
{"comments": [{"comment": "My cuban Shotputter always used this befor a competition", "username": "britexpat", "commentId": "comment-7418561"}], "question": "anyone know where i could be able to buy \"DYMATIZE MASS GAINER \" in qatar? ", "username": "Infas111"}
{"comments": [{"comment": "NEW ORBIT TRADING-QATAR 44314434", "username": "tasli", "commentId": "comment-7421821"}], "question": "ANYBODY KNOWS, WHERE CAN I GET HEAT TREATED WOOD IN QATAR (4INCH x 4 INCH, 3 TO 4 MTRS IN LENGTH) REGARDS JAISON -74725500", "username": "jaison_2920"}
{"comments": [{"comment": "Ravi, I am sorry for his loss but we at QL always say why do you carry cards if you are having cash in your wallet ........... still we will look around the area if you can tell us the places he may have dropped his items ............", "username": "Molten Metal", "commentId": "comment-7418931"}], "question": "Dear Friends, My driver (Name: Jhup Bahadur Shahi) lost his wallet on Friday (04/11/2016) His Qatar ID; 28152409116 Below are the things in wallet 1.Cash around QAR: 1,000.0 2.Qatar ID 3.Commercial Bank Debit Card 4.AXA Insurance Card 5. Some other papers Kindly help us to find the wallet. Please inform below numbers if anybody found the wallet. Thank you in advance. Jhup Bahadur Shahi - 5041 9080 Ravi Are - 3026 2454", "username": "raviraj.are"}
{"comments": [{"comment": "Yes.", "username": "Lucky Luciano", "commentId": "comment-7419051"}], "question": "The worker who is doing resignation ,He is eligible to get a return air ticket to Home country? Any Eligibility Criteria?", "username": "qaac04"}
{"comments": [{"comment": "If you have these simptoms a week after that, go to the doctor immediatelly. I jelly fish sting goes away normally in 2-3 days. You might have some infection.", "username": "Dracu", "commentId": "comment-7419781"}, {"comment": "ok but is it usefull if i use after one week of getting bitten", "username": "sd.sameer20", "commentId": "comment-7419666"}, {"comment": "Dear Mr Rizks.... What type of vinegar should one use ? Red Wine Vinegar. ... Balsamic Vinegar. ... Distilled White Vinegar. ... Apple Cider Vinegar. ... White Wine Vinegar. ... Champagne Vinegar. ... Sherry Vinegar. ... Rice Vinegar.", "username": "britexpat", "commentId": "comment-7419641"}, {"comment": "To reduce swelling put warm water over the area for 5 mins / 2 times a day to get some relief .............", "username": "Molten Metal", "commentId": "comment-7419611"}, {"comment": "Use Vinger on the area where u got bitten.....", "username": "Rizks", "commentId": "comment-7419551"}], "question": "I got bitten by jelly fish last week at umsayed, please keep an eye when u r swimming in the sea water It was painfull that day and then started to heel up almost 80% and then after one week it swlled up and became red and painfull exactly after one week. Should I consult a doctor Exactly is the same phenomenon and timing is happening with my friend who also faced jelly fish bytes with me last week.", "username": "sd.sameer20"}
{"question": "Hi all, Any suggestions as to where I may find a roll bar to fit on the back of a Ford Ranger?", "username": "Motorhead"}
{"comments": [{"comment": "Immigration is accepting visit visa applications for wife & children's if the salary is 4000 plus company accommodation but condition: designation in residence permit should not be labor category at least Admin, supervisor, or above. Tenancy contract is mandatory to submit along with application and no need bank statement.", "username": "Syed01@yahoo.com", "commentId": "comment-7417051"}, {"comment": "hello goodevening im angel from alostoora travel and tourism.. we can assist and provide u for visa need. for more details and information u may free to call me in my mobile #66957271.", "username": "Alostoora Travel and Tourism", "commentId": "comment-7417041"}, {"comment": "http://nricafe.com/qatar-visit-visa-family-members/ These are the documents u shd submit .. U try and see", "username": "iswariya", "commentId": "comment-7417021"}, {"comment": "http://nricafe.com/qatar-visit-visa-family-members/ These are the documents u shd submit .. U try and see", "username": "iswariya", "commentId": "comment-7417016"}, {"comment": "Now 5000 I think for other relatives,, 7000 for wife in family visit visa", "username": "iswariya", "commentId": "comment-7417011"}], "question": "My salary is Qr. 4500. can i get visit visa for my wife under my sponsership. please suggest what should be the minimum salary.", "username": "yasi253"}
{"comments": [{"comment": "Dear Sir, Present your expired driving licence and your visit visa at Traffic Department Headquarters, Omar Bin Abdul Aziz St, Al Messila, Doha. You will get temporary driving licence which will be valid till you visit visa but when you get permanent visa then again you have produce Qatar RP ID & temporary driving licence to get permanent driving licence. Thanks & warm regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7419701"}], "question": "before 4 years back iam in qatar and i got qatari driving license.now it is expired, now iam here in bussiness visa can i renew that driving license.", "username": "rajesh77"}
{"comments": [{"comment": "Thanks, Britexpat. much appreciated. By the way, would you say the maintenance of American brands such GMC, Ford, Cheve...are quite same as Lexus pls or? Thanks again.", "username": "janoozajm", "commentId": "comment-7419961"}, {"comment": "Landrover maintenance is out of this world here .. Too expensive.. Lexus cars are reliable and durable. The servicing is more than for a Toyota, but then that's to be expected and you get good after care service. It is less tham Mercedes and BMW. At the end of the day , buying a car is subjective. When going for Lexus , BMW or Mercedes , one doesn't really worry too much about servicing costs.", "username": "britexpat", "commentId": "comment-7419716"}], "question": "Dear friends, After I had a bitter experience with Land Rover LR2 for about 3 years, I would like to go for a reliable solid sedan car that should give a smooth driving pleasure and safety. I'm thinking to go for a Lexus IS 300/250 2008 - 2010 model, but most of my friends telling me that while Lexus are great cars they are so much more expensive to fix than other Japanese cars. But how can that be? The majority of the parts are made by Toyota, no? I can see a few places where it would be expensive, but for the most part is it that bad? I feel confident if I buy a Lexus, it is going to last me a good while. But are they REALLY that much more expensive to fix versus a Camry/ Nissan Maxima or are they equal to BMW, Mercedes, Land-rover maintenance?or in between Toyota and BMW/Benz? Help me out so I can make my purchase in peace. Appreciate your feedback,", "username": "janoozajm"}
{"comments": [{"comment": "hi u get rental aggrement from company or ur houseowner...", "username": "V.P.Kumar", "commentId": "comment-7419931"}, {"comment": "She will have no issues .. Just remember to send her home on time", "username": "muad-db", "commentId": "comment-7419846"}, {"comment": "waihms why dont you applied visit visa for your MIL, and also any age limit for senior citizens of Indian origin.", "username": "aswanika", "commentId": "comment-7419801"}, {"comment": "Our family visit visa application was rejected as we was not able to get baladiya attestation on rental agreement..", "username": "waimhas", "commentId": "comment-7419766"}, {"comment": "check with your pro... age s not prob they are coming in business visa y u didn't get family visit visa. . tat can b extended to 4 th month in any valid reason like this this is only 200 riyal for one person one month business visa s too costly na?", "username": "iswariya", "commentId": "comment-7419746"}], "question": "hi all i have planned to bring my mother in law in business visit visa for three months , for my wife's delivery . the visa is ready to print too. my doubt is will she face any problems at the immigration check , does she has to carry any special papers or documents. she is aged 53 indian national. ( our application for family visit visa was rejected due to  baladiya attestation on rental agreement issue ) please help with your comments  thank you", "username": "waimhas"}
{"question": "im Irish, just got here, living in west bay and looking to see is there much 11 a side football? I'm playing 5 a side with work colleagues but am interested in 11 a side on grass.  does anyone know of a way of playing 11 a side at a medium (not high) standard, preferably with a mix of ex pats and locals. thanks conor", "username": "foleyco"}
{"comments": [{"comment": "hello goodevening im angel from alostoora travel and tourism.. we can assist and provide u for visa need. for more details and information u may free to call me in my mobile #66957271.", "username": "Alostoora Travel and Tourism", "commentId": "comment-7417046"}, {"comment": "Plz inbox in qatar living i m also facing same problem..", "username": "iswariya", "commentId": "comment-7417026"}, {"comment": "As per ur plan U can but while applying QID person varied na they may ask so u confirm.. then after exit only u can apply for visit visa again So 28th gng na 29th only u can apply lyk it shd b working day so plan accordingly...", "username": "iswariya", "commentId": "comment-7417006"}], "question": "My wife visa will expire on 30/11/2016. i am planning to go to UAE on 28/11/2016 with my wife. 1. Can i apply for family vist visa on 28/11/2016 before i fly to UAE. ? and then enter qatar after i get family visit visa.  2. If not, Can someone else apply family visit visa on my behalf after me and my wife fly to UAE ? 3. Is it mandatory that only husband should apply family visit visa for wife ? Kindly advice if anybody has experienced. Thanks  ", "username": "nishar0590"}
{"comments": [{"comment": "HAI, AM ADILA MAJEED FROM INDIA. AM A PROFESSIONALY QUALIFIED SPEECH AND HEARING THERAPIST.AM HAVING MORETHAN 3 YEARS EXPERIENCE AS SPEECH THERAPIST. AM RESIDING QATAR NOW UNDER MY HUSBAND SPONSORSHIP, NOW AM TAKING PERSONNEL CONSULTATION AT MY HOME FOR THE CHILDRENS. IF ANY PARENTS NEED SPEECH THERAPIST FOR YOUR CHILDRENS. KINDLY PLEASE CONTACT ME. ADILA MAJEED +974 66745015 adilamjd90@gmail.com", "username": "adilamajeed", "commentId": "comment-7412271"}], "question": "Can anyone provide info regarding speech therapist for kids through their experience. There are quite a few different speech therapy institutes and persons providing private sessions. Cannot go on trying everyone, so I need if someone has first hand experience with good results. Thanks", "username": "salrza"}
{"question": "I have a car Land Cruiser Prado 4 cylinder,2010 model, 2.7 L 17000 km very good condition No accidents No off Road driving how much price i can expect", "username": "radinzayyan"}
{"comments": [{"comment": "The best thing to do is search QL Classifieds for similar models .. Also visit other online sites like Qatarsale.. You will get an idea of the price", "username": "britexpat", "commentId": "comment-7412416"}], "question": "what price i can expect for Prado 2010 model , 4 cylinder 2.7 litre, white, very good condition, No accident ,No off road driving. 170000 km", "username": "radinzayyan"}
{"question": " ", "username": null}
{"comments": [{"comment": "DEAR brite-----forget to mention speed thrills but kills....", "username": "mango@enjoy2", "commentId": "comment-7413311"}, {"comment": "Always use your mirror and keep away from fast drivers", "username": "muad-db", "commentId": "comment-7413296"}, {"comment": "This is wise advice. I was a passenger in Rizks' car the other day. He was on the phone all the way discussing menus with the Michelin Star Chef he has hired and kept being distracted by text messages from his beloved :O(", "username": "britexpat", "commentId": "comment-7413286"}], "question": "DEAR ALL PLEASE DRIVE SAFELY... 1 Keep your eyes on the road When you are driving, you should be doing just that and nothing else. 2 Never use your cell phone There is no good reason to be talking on a cell phone while you are driving 3 Don’t change CD’s 4 Never, ever drink and drive 5 Ignore aggressive drivers", "username": "mango@enjoy2"}
{"question": "Hi, I am seeking a maid for my family. We have one toddler and expecting a new member any day soon. Insha'Allah. We live in a 2bR...so the 2nd room will be the toddler / guests. We don't think we can have a live-in maid. The question is:  1) Does anyone have any agencies they would recommend for a Part-time maid? 2) If the maid works \"10hrs / 6 days\" how much would the rate be? Any names & numbers would be useful. Other than my points about hiring a \"Non-Live-In\" maid, I would like to hear feedback about pros vs cons of Live-in vs Non. Thank you  ", "username": "MartyStevens2"}
{"comments": [{"comment": "Dear Sir, If she already got visa from school then It is very simple, just give your NOC & Qr. 500 at immigration office. She will be transferred from your visa to school visa. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7413696"}], "question": "", "username": "srilankan_88"}
{"comments": [{"comment": "The company is registered and the banks it's not the problem.(bank already proposed for car loan) It's the employer who refuses to transfer my salary there...", "username": "Stijn1987", "commentId": "comment-7414411"}, {"comment": "your company must be registered with the bank from where you will avail the loans and stuff. hope you get the Idea! It's of NO USE opening an account in some other banks.", "username": "fgnhgn", "commentId": "comment-7413491"}, {"comment": "Thanks for the comments so far. I could open a second acount but that bank would not be able to provide me a car loan or anything else later on since my salary would not be transferred to them. Even do if they could give me better rates/conditions than CBQ.", "username": "Stijn1987", "commentId": "comment-7412871"}, {"comment": "Dear Sir, It is not possible to have different salary account as under new Ministry of Labour rule all the employees salary has to be transferred in one single bank through WPS format. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7412831"}, {"comment": "Stijn my pal...speak kindly to your HR, take the HR Manager to dinner and perhaps they will be accommodating. One comment omitted the \"dinner part\" which is important to achieve such goals!", "username": "acchabaccha", "commentId": "comment-7412751"}, {"comment": "Stijn my pal .. Speak kindly to your HR and perhaps they will be accommodating ..", "username": "muad-db", "commentId": "comment-7412681"}, {"comment": "This is just laziness on the part of your company. They probably do bulk salary transfer each month and can't be bothered to have indivisuals with other institutions. Also, by having another bank, they may delay your transfer each month. Best to bite the bullet and open another account somehwere else for normal transactions", "username": "britexpat", "commentId": "comment-7412646"}, {"comment": "Ideally, your sponsor has no right to force you. However, if there is no alternate option then open two bank accounts i.e. One in CBQ for salary transfer and Another in bank of your choice.", "username": "Rainbow77", "commentId": "comment-7412631"}], "question": "Dear Expats,  I arrived some weeks ago in Qatar. I went to check with wich bank I prefer to do my business. Now my employer is saying that they only tranfer my salary to CBQ... I prefer another bank but that bank can not give me any facilities such as CC or maybe car loan for later on. My question is how or can my employer decide where my salary need to be tranferred?? I think that should be up to me where, same as I decided before with my bank in Dubai.", "username": "Stijn1987"}
{"comments": [{"comment": "Dear Sir, You need valid visa (atleast visit visa) to get back your driving licence. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7413701"}, {"comment": "I believe you need a valid Qatar ID.. See link ; http://www.qatarliving.com/visas-permits/posts/qatari-driving-licence-renewal", "username": "britexpat", "commentId": "comment-7413686"}], "question": "Dear All, Please advice how to get Qatar driving licence if lost the original one. My Qatar RP cancelled on last year but the driving licence still having validity. I am planning to come qatar by next year, can I get the licence card if submitting the licence xerox copy???? I Appreciate your feedback....Thank you....", "username": "ITTCqatar_2015"}
{"comments": [{"comment": "@syed thank you for the reply. its so useful to me and many. so aftwr law changes, he will break the rule (giving resign one month before going) and he may come back with another visa witout any ban.?", "username": "Jayakumargosangi", "commentId": "comment-7417376"}, {"comment": "Sorry, I mean to say he cannot transfer directly without exiting the country until he complete his contract period in unlimited contract but he can break with one month notice period cancel his Residence Permit and come back with new contrat / visa without NOC.", "username": "Syed01@yahoo.com", "commentId": "comment-7414991"}, {"comment": "Dear It depends on which type of contract the employer is preparing, if it is limited period contract employer or employee cant terminate (except gross misconduct) before it expiry. But if it is unlimited contract (like we all currently have) then employee or employer can terminate with one month notice pay or notice period and there is going to be no pan for this type of contracts anymore and employees can come back even the next day after cancelling their residence permit and leaving the country without NOC from current employer. But he cannot transfer the current residence permit before completing his 2 or 5 years contract without NOC even if it is unlimited period contract. New Law Brief Qatar Ministry of labor has done preparation for the new rule and regulations of the labor laws related to entry and Exit of Expatriates and this will starts implementation from 13th of December of year 2016. These Changes really transform lives of common worker in Qatar as this laws totally convert kafala system to Contract based System. Everything written in contract is applicable rest of the things were deducted. Executive regulations are bye-laws that explain each article of a law and explain in detail how they are to be put in force. The law (Number 21 of 2015) regulating the entry, exit and residency of foreign workers was issued late last year, amending a previous legislation. Law Number 21 of 2015, which abolishes the stipulations of Law Number 4 of 2009 regarding Regulation of the Expatriates Entry, Departure, Residence and Sponsorship, was issued on October 27 last year. Among other changes, the new law abolishes the current two-year ban on expatriates who want to come back to the country on a new visa. Presently it requires a no-objection certificate from the previous employer for a former resident to take up a new job in Qatar. The new legislation will replace the sponsorship system and make the employment and stay of expatiates here entirely contract-based. Job contract will need to be signed by a foreign worker before he lands here once the new law is in effect from later this year. Also, employment contracts of all expatriate workers who are already here will be replaced with new contracts. In other words, all expatriate workers will have to sign new contracts with their employers in compliance with the provisions of the new law (No 21 of 2015). “Since the new law abolishes kafala (sponsorship system), a person who had previously worked in Qatar would not have to seek the approval of his former sponsor if he is recruited by a new employer,” Brigadier Mohamed Ahmed al-Atiq, assistant-director general of the Department of Border, Passport and Expatriates Affairs, had said while explaining the salient features of the new law. “A foreign worker who has got a new contract to work in Qatar can come back even the next day, provided he has met the other requirements like visa,” he had said. This contract will form the basis of the relationship between a foreign worker and his employer. The contract will be signed for two or five years’ duration and both the sides will be obliged to follow its clauses that will contain terms and conditions. Once the new law is in effect, the exit permit system whereby a foreign worker needs written permission from his sponsor to travel overseas will also end. A worker would only need to inform his employer about his departure. According to Article 26 of the new law, if a foreign worker is fired as a punitive measure and he did not appeal his dismissal or his plea was rejected by a court, he shall not be permitted to come back to Qatar before the passage of four years. Also, an expatriate worker repatriated upon a court verdict cannot come back unless he got the approval of the Minister of Interior. According to the new law, expatriate workers can change jobs with government permission, either after the expiry of their contracts or after five years of service with their employer in case of open-ended contracts. For changing of jobs before the expiry of contract, the new law stipulates that the expatriate worker has to get the approval of the employer, alongside the concerned government entities. The new law also enables expatriate workers to apply exit permits themselves through the approved channels of the Ministry of Interior, without having to seek the permission of the employer. The request would be granted within three working days. In cases of emergency and the mutual agreement of both the worker and the employer the exit permit will be granted immediately. According to new law no approval from former employer is required if he is recruited by a new employer. An expat can also move to another sponsor with the approval of MOI and MOLSA if the sponsor is dead or the company no longer exists for any reason. 16 things you need to know about new law kafala changes 1. New law would be implemented by this year 2016.(updated) 2. New law will make employment and stay of expatiates entirely contract-based. 3. Two-year ban on a new work visa will no longer be applicable. 4. No approval from former employer if he is recruited by a new employer. 5. Worker who has got a new contract to work in Qatar can come back even on the next day. 6. Exit permit will not be required for travel it will become invalid with enforcement of new law. 7. To leave country employee needs to inform his employer before three days and apply through in Metrash 2 system. 8. All employment contracts of all expatriate workers who are already here will be replaced with new contracts by the end of this year. 9. Date he has signed the fresh employment contract will be the date from his contract would be counted. 10. Employment contract has to approved by the Ministry of Labour and Social Affairs. 11. Closed contracts shall not exceed a period of five years. 12. Employes with Open-ended contracts can move to another employer after spending a minimum of five years with the first employer. 13. Workers with fixed job contracts can change their work and sign new contracts if they wish so at the end of the contract period without any NOC but approval from the Ministry of Interior and the Ministry of Labour and Social Affairs. 14. An expat can also move to another sponsor with the approval of MOI and MOLSA if the sponsor is dead or the company no longer exists for any reason. 15. QR50,000 fine and jail terms of up to three years for recruiters who allow their employees to work for other parties without prior official approval. 16. QR10,000 to QR25,000 fine for keeping passport of expatriate employee.", "username": "Syed01@yahoo.com", "commentId": "comment-7414986"}, {"comment": "@syed thanks for your reply. his medical test is over. if he resigb after Dec13, did he come back with another visa? bt someone told me that in new rule it state that, person have to work for two years and then after he dnt need any noc to join in another company.is it true? and main thing is, my friends present company make him ti sign on Unlimited contract preiod. he did sign. is there any problem after rule arraivs", "username": "Jayakumargosangi", "commentId": "comment-7414486"}, {"comment": "RP means Resident Permit Card. If he his decision of leaving is final then he should not go for medical and submit resignation immediately since if he exit Qatar without completing this procedures then he no need NOC to come back again to any other employer once he has new visa. And no need to even wait for new law until 13 Dec. If he completes the process and get Residence Permit now then he can submit resignation after 13 Dec to cancel the RP and exit and enter in new visa even the next day without NOC subject to approval of new visa.", "username": "Syed01@yahoo.com", "commentId": "comment-7413596"}, {"comment": "RP means Resident Permit Card. If he his decision of leaving is final then he should not go for medical and submit resignation immediately since if he exit Qatar without completing this procedures then he no need NOC to come back again to any other employer once he has new visa. And no need to even wait for new law until 13 Dec. If he completes the process and get Residence Permit now then he can submit resignation after 13 Dec to cancel the RP and exit and enter in new visa even the next day without NOC subject to approval of new visa.", "username": "Syed01@yahoo.com", "commentId": "comment-7413591"}, {"comment": "@syed what is RP? he is going to medical test on 8th. and passport is with company only.", "username": "Jayakumargosangi", "commentId": "comment-7413106"}, {"comment": "@ismailki thank you.", "username": "Jayakumargosangi", "commentId": "comment-7413101"}, {"comment": "@Syed thanks for advice. if he exists after 13th dec, when he will come back after one two years or next day?", "username": "Jayakumargosangi", "commentId": "comment-7413096"}, {"comment": "As the others have said .. If he has not been issued an RP, then he can resign and come back..", "username": "britexpat", "commentId": "comment-7412991"}, {"comment": "Dear Sir, If your friend has not got permanent Qatar RP Id card then he can resign and come back on new visa. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7412971"}, {"comment": "@Ismailki - don't be rude, either party has a chance to terminate during probation period. Everybody is here to earn money and should have freedom to change the job like in other countries.", "username": "Syed01@yahoo.com", "commentId": "comment-7412961"}, {"comment": "Hold on, If he has not completed his finger print and RP is not processed, then he can straight away resign and leave the country to come back to new company with NOC. If the process is already done then nothing can be done until new rule comes into effect on 13 Dec.", "username": "Syed01@yahoo.com", "commentId": "comment-7412956"}, {"comment": "If he resigns, cancels his visa and exit after 13 Dec, he can come back to new company without current company NOC. Direct transfer without NOC will only be possible after 5 years and with NOC after one year.", "username": "Syed01@yahoo.com", "commentId": "comment-7412951"}, {"comment": "Yes, he will get ban. Since he is on work visa, he cannot join another company without NOC. Educate your friend about the ethics in employment. He should show some commitment to the Employer who gave a Visa and job.", "username": "ismailki", "commentId": "comment-7412936"}], "question": "hi friends, one of my friend recenctly joined in a companu just a month ago in qatar. his contract period is unlimited. presently he is in probation period upto 6months. he got a new chance in another company with high pay. if he resign to his present job now, did he get ban for two years, or anything else to do.please answer", "username": "Jayakumargosangi"}
{"question": "", "username": "Highlandmac"}
{"question": "Hi, I recently moved to Qatar from the USA. I am having trouble getting a Qatar license. I have a US license and have been driving in the US since the past seven years without any issues. The problem is that when I gave the road test here they failed me twice. I went to Al Rayyah driving school. The last time I gave the test I did not make any mistake but the officer still failed me. The two other people testing with me passed because they had a \"wasta\". I am a lecturer and have a very busy schedule so taking a course is almost impossible for me. I was wondering if someone here can give me suggestions or it would be great if someone can find me a \"wasta\" also. Thank you.", "username": "maa85"}
{"question": "Dear All - I had a change of address in India and hence passport was re-issued with new passport no. But my RP is in old passport. Are there any immigration procedures to be completed before travelling to QATAR on the same RP. Your advice and inputs will help me a lot.", "username": "contactmrk"}
{"question": "My exit permit will expire on 26th of Oct, so does it mean i can travel till 26th oct. someone please help? I am traveling on 26th afternoon", "username": "Doha82"}
{"question": "Hi guys, I am looking for 1bhk fully furnished for family visit for 6months in old airport, toyota signal, barwa village, dps wakrah or thumama area. Is anybody availave here who has taken family accommodation for 1 year and his family wanna leave in december for 6months. I need from second week of december. No commission.  31579131", "username": "SYED3233"}
{"question": " ", "username": "waelhelmy"}
{"comments": [{"comment": "Hi, how are you? can you pls. tell me what happened to your car now? Thanks", "username": "artbad2003", "commentId": "comment-7416291"}, {"comment": "dear friend you have to keep your vehicle in industrial area 52 police for a one week.some small penalty will be there.if they will find your vehicle some ware in Doha it will be problem..", "username": "aslam 000", "commentId": "comment-7412431"}, {"comment": "dear friend you have to keep your vehicle in industrial area 52 police for a one week.some small penalty will be there.if they will find your vehicle some ware in Doha it will be problem..", "username": "aslam 000", "commentId": "comment-7412426"}], "question": "Hi Folks, Two weeks back I got a fine of 1000QR and have been asked to come to Street-No.52 Industrial area police station. I have registered in Metrash and hence received these messages in mobile. No black points are there , as I checked in website later. My offence is overtaking through right @ Al-Sadd-6:06 AM. Incident happened on 9th Oct as per the message. Kindly advise; 1) Is there any time frame within which I have to report. 2) Will my car be impounded. If so, for how many weeks. Please note there are no black points. Regards AK", "username": "Aasish"}
{"question": "", "username": "gawhar"}
{"comments": [{"comment": "Ar eyou actually serious ? He should have gone to A&E immediately. If time has passed, then tell him to go to the company doctor or any doctor", "username": "britexpat", "commentId": "comment-7411086"}], "question": "", "username": "a_salom"}
{"question": "", "username": "Navin Gowda"}
{"comments": [{"comment": "Hi VP Is there like some nationality bun as i suspected on my visa application for my wife .Or requirements are different for every nationality.?", "username": "InquiryJay", "commentId": "comment-7420516"}, {"comment": "Hi VP, you can apply immediate, there is no time limit, by the way where r u from. before you apply check all the documents thoroughly.", "username": "aswanika", "commentId": "comment-7412966"}], "question": "if family permanent visa rejected in qatar when we can apply again...", "username": "V.P.Kumar"}
{"question": "I finished my Engineering in Electronic & Communication (ECE ) But I'm working in Electrical field now ,If i apply for MMUP whether question will be related to Electronic & communication or Electrical ?? - Please advise Do u have any questions related to MMUP please share to this mail ", "username": "jeeva.naveen"}
{"comments": [{"comment": "Dear All Please note that their is no ban period after 12 Dec. If you want to come back in new visa with new employer you can do that the next day provided you get visa approval. Only NOC is required if you want to transfer the visa inside country without cancelling and exiting the country before contract expiry.", "username": "Syed01@yahoo.com", "commentId": "comment-7408576"}, {"comment": "Basically NOTHING has changed. If you take up a job and find that you are maltreated you'd have to wait five years to get free. If you resign earlier you are banned for to years. When do you guys understand that the government of Qatar is fooling you?", "username": "Wild Turkey", "commentId": "comment-7408501"}, {"comment": "MM: Both your answers differ... Which is correct and to be believed", "username": "britexpat", "commentId": "comment-7408461"}, {"comment": "Sheen is right, 2 years pass so quickly as you will wait for a better pay & a nice employer ...................", "username": "Molten Metal", "commentId": "comment-7408346"}, {"comment": "Dear Sir, Under the new law, indifinte contract will be converted to 5 years contract. After the person completes the contract then they will get NOC from Ministry of Labour. If she don't complte her contract then she will face 2 year ban. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7408336"}, {"comment": "Dj, She is very wise. Let her continue for about 6 more months and resign when new law comes effective ........... then she will get more benefits ............... after that she can come back with a better employer , wish her god luck ............ !", "username": "Molten Metal", "commentId": "comment-7408321"}], "question": "Good day. I have a question with regards to the new labour law. My friend is currently on an indifinte contract.. She was told by her employer that she would need to sign a new contract from them once the new law is in effect but she doesnt want to sign a new contract from them. She wants to resign and find a new employer once the new law is out. 1. Is it possible for her to look for a new job? 2. Or will she get banned here in Qatar from doing this? 3. Besides, her current employer wont give her NOC, can she still find a new job without this?", "username": "djoanonymous"}
{"comments": [{"comment": "Tim, They are the best in that area, all the staff is very friendly .............. Go for it .............. Joys .......................", "username": "Molten Metal", "commentId": "comment-7408341"}, {"comment": "http://daffodilsnurserydoha.com/about-us/", "username": "iswariya", "commentId": "comment-7408231"}, {"comment": "Montezine nursery montezinenursery.com", "username": "iswariya", "commentId": "comment-7408226"}, {"comment": "I want to know the nurseries which is in Matar Qadeem", "username": "timbi", "commentId": "comment-7408176"}, {"comment": "Honeypot Springfield Future nursery See address in google.. good school these three", "username": "iswariya", "commentId": "comment-7408171"}], "question": "Can anyone give me some update about the Playhouse Nursery which is in Matar Qadeem", "username": "timbi"}
{"comments": [{"comment": "http://nricafe.com/qatar-visit-visa-family-members/", "username": "iswariya", "commentId": "comment-7408601"}], "question": "Dear QL Kindly advise on requirements needed for family visit visa.My wife recently resigned From QA and NOC was not granted.Can i be able to bring her back in qatar on family visit visa??Please assist....", "username": "InquiryJay"}
{"comments": [{"comment": "pls do not go to Human Rights there u will not treat as a Human.... sure you can lodging a complaint at the Labour Office.", "username": "blackindian1654", "commentId": "comment-7408806"}, {"comment": "pls do not go to Human Rights there u will not treat a Human.... Committee sure you lodging a complaint at the Labour Office.", "username": "blackindian1654", "commentId": "comment-7408801"}, {"comment": "The answer to both your queries is that they cannot do anything. You must keep a copy of your resignation letter with you or send them your resignation by email and keep a copy. In case they refuse to accept your resignation and stop you from leaving the country, you can take the assistance of Human Rights Committee followed by lodging a complaint at the Labour Office. They will surely help you out. Having said that, there are QLers who will post telling you that \"employers are like your father and you should treat them nicely. Take them out to dinner and see the results. Everything will be fine ...Joys\" etc. It takes all sorts of people to make this world!", "username": "acchabaccha", "commentId": "comment-7408736"}, {"comment": "As far as I'm aware, the company cannot reject your resignation, nor can they refuse an exit permit. I would suggest speaking to your embassy first , but more importantly approaching the Human Rights Commission", "username": "britexpat", "commentId": "comment-7408731"}], "question": "My contract will eXpire this december, 2016. I have given my non-renewal of contract letter last july, 2016.  1. Can my employer reject this letter? What legal actions can I take?  2. My employer is telling me that they will not give me exit permit and that they will ban me from leaving the country for 6 mOnths. can they do this? What legal actions can I take? ", "username": "crystalleine"}
{"question": "we would like to register an organization in Qatar for the students of AMA from Kerala, India. AMA is a registered  academy in India. Please advice that, how we  can get the registration & approval to work as an official student organization in Qatar. ", "username": "shanjoseph"}
{"comments": [{"comment": "How do I know I have Fiber connection in my apartment", "username": "tasali", "commentId": "comment-7409496"}, {"comment": "You must to go personally to any customer care office of ooredoo with your ID and Electricity number. They will book your connection ,within a week you will get SMS confirmation regarding to take your appointment to make connection to you home.By the team ooredoo team reches to your home you should be available at home. For saving time ,check first do you have Fiber connection in your apartment if not tell clearly to team before they reaching to your home", "username": "factmachine", "commentId": "comment-7408986"}], "question": "How to apply for Fibre optic Internet connection for my house. Please let me know.  Do I need to visit the Ooredoo outlet for applying for this facility with my QID and Electricity number.   ", "username": "tasali"}
{"comments": [{"comment": "oh Brit, you are so right! Every time I go to Industrial area - it always works! the S-M-I-L-E.... :) :) :)", "username": "zafirah", "commentId": "comment-7410741"}, {"comment": "Women can get away with anything - just because of those bumpy bits and that smile :O(", "username": "britexpat", "commentId": "comment-7409721"}, {"comment": "The last time someone buzzed me the second the light went green and i was already moving i stopped the car and waited untill red again. The guy went crazy and kept honking and i ignored him. i am lucky i am a lady. Lol", "username": "mjkop005", "commentId": "comment-7409706"}, {"comment": "What about if you're honking at a pretty girl strolling down the corniche ?", "username": "britexpat", "commentId": "comment-7409561"}, {"comment": "It is dangerous to honk at people ahead of you especially at roundabouts as the driver may enter the roundabout and cause an accident. I have seen many people doing it. I would be good if people had a little more patience.", "username": "darwikishore@gmail.com", "commentId": "comment-7409541"}, {"comment": "\"The distance between a car and the one behind is directly proportional to the size of the car behind.\" This has become the norm in Qatar now. (Tailgating)", "username": "shahadav@gmail.com", "commentId": "comment-7408926"}, {"comment": "Its normal in this part of the world ! Get use to it.......The Sooner the Better ! Cheers", "username": "Rizks", "commentId": "comment-7408906"}, {"comment": "There is no need to \"honk\" at any time - except in an emergency where an accident may occur. Qatar is mostly expat, so expats are just to blame as locals - if not more so.", "username": "britexpat", "commentId": "comment-7408881"}, {"comment": "Your driving style reflects your character. People in Qatar are unpleasant and aggressive. This could possibly be due to the extreme climate. Ha, ha, ha.", "username": "Wild Turkey", "commentId": "comment-7408871"}], "question": "My advice is for all the readers, especially the \"educated\" motorists among you. I have been driving in Qatar for the past five years and it has been fun. However, there's one thing that keeps bothering me - excessive honking. It's really annoying and I guess some of you have no idea of its consequences on the environment and health. Someone once said that your driving reflects your manners. In my last five years of driving, I have noticed that a lot of drivers on the road (including expats) expect all other cars to move over as per their convenience and at his desired speed. The roads must be open for him/her and has no courtesy to give way to fellow drivers despite knowing that there's ongoing constructions every where.The large SUVs think it's their right to honk at each and every person on road. All though I encourage the use of horn when appropriate to avoid danger but their use must not become a fashion such as flashing the lights which has already become one. I have also seen number of drivers getting involved in road rages because of using unnecessary horns because you probably don't know who you're honking at. Rant over. Please do comment  so as to know whether my thinking is right or wrong. Even negative comments are appreciated.", "username": "fgnhgn"}
{"comments": [{"comment": "Best and Cheap don't go together .. You pay peanuts , you get monkeys", "username": "britexpat", "commentId": "comment-7408901"}], "question": "I would like to know which Urologist best for men’s weakness treatment in Qatar (Dr. Maria Colavita of Al Hayat Medical Center or Dr. Raju Abraham of Aster Medicare clinic and also their treatment’s detail and cost.", "username": "subkachacha"}
{"comments": [{"comment": "Such wise advice .. Thankyou", "username": "muad-db", "commentId": "comment-7409061"}], "question": "Replacing lost identification documents can be a pain in the neck. You won't expect it to happen but when it happens it happens. A QLer recently shared his experience and the steps he had to go through to replace his residency card (Qatar ID). You may or may not go through the exact same steps depending on your visa type.    The following steps particularly apply to those under a  visa. However, the procedure for replacing a lost residency card (Qatar ID) is almost similar across all visa types.  1. Take a copy of the lost Qatar ID (if available) and the original passport of ID holder along with the original ID of the sponsor. If you do not have a copy of the lost ID, you will at least need the Qatar ID numbers. 2. Head over to one of the Immigration Service Centers (Gharrafa, Mesaimeer, Rayyan) during morning hours starting 7am and ideally before noon. Apparently they do not process lost Qatar IDs in the afternoon. SURPRISE!! 3. Go to the lost ID section and submit the documents there. They will process your request for a replacement and give you a document in Arabic. 4. Now take a token from the issuing counter. You will be summoned to the \"Lost ID\" counter 5. You will be charged QAR200 for replacing a Qatar ID. They don't accept cash so you will need a debit/credit card. : If you're sponsored by a company, you will need a NOC in Arabic (a letter requesting for replacement) from the company. You do NOT require a police report for Qatar ID replacement.", "username": "Qatar Living"}
{"comments": [{"comment": "Sorry guys..I just copied the first part from somewhere else.. i dont like duster...i want to purchase either Fluence or Magna.", "username": "Dileep3260", "commentId": "comment-7409746"}, {"comment": "Duster is a run of the mill SUV. It is cheap to run, cheap to buy and not very powerful. However, for the price, it is good value. Low resale value. All Renault's are cheap in GCC - not a big market for them.", "username": "britexpat", "commentId": "comment-7409586"}, {"comment": "Wants DUSTER- Feed back and purchase either Fluence or Magna. Make up your mind", "username": "Lucky Luciano", "commentId": "comment-7409576"}], "question": "RENAULT - Feed back please??????????????Is it good and reliable in Qatar?What about the maintenance cost? I am looking to purchase either Fluence or Magna.. Please advice", "username": "Dileep3260"}
{"comments": [{"comment": "Dear Sir, Yes there is high chance of you not getting new visa of a GCC country. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7411911"}], "question": "Hi friends.. i was working in qatar in a private media company from March 2015 & i came for a vacation on june 2016.. i was about to be back to work on september month but now my sponsor is not ready to give me the salary which i was getting before, so i am not  ok with the new salary agreement.. My qatar visa is not yet cancelled and my qatar id expires on March 2017 and my doubt is, if my qatar visa is not cancelled, will it be a problem for me to get a job or visa in other GCC countries like Dubai or Muscat..  ", "username": "renney"}
{"comments": [{"comment": "All newspapers have (usually free) home delivery. Buy whatever newspaper you want, call up their home delivery number and talk to them.", "username": "time_to_move_on", "commentId": "comment-7409236"}, {"comment": "But Babu needs a Mallu paper boy due financial constrains ;)", "username": "Lucky Luciano", "commentId": "comment-7406821"}, {"comment": "i would be more than happy to speak to my Nephew, he is a very fine paper boy in the chipping sodbury area", "username": "sir Richard Head", "commentId": "comment-7406421"}], "question": "Need any english newspaper delivered to home. Any contact numbers?", "username": "baisil babu"}
{"question": "", "username": "farusx@gmail.com"}
{"comments": [{"comment": "I dont want to know how they are interviewing candidate I wanted to know what is the HR System is it Oracle,or SAP is used in HIA", "username": "timbi", "commentId": "comment-7406366"}, {"comment": "As far as i am aware there is only manual system and selection by interview in HIA. Software is not used, although website applications have some filters built in for screening candidates.", "username": "rajeshnairs", "commentId": "comment-7406361"}, {"comment": "Just out of curiosity. Why do you need to know the system ? Are you applying for a job in HR or IT ?", "username": "britexpat", "commentId": "comment-7406336"}], "question": "Can anyone share with me what is the HR System used by HIA?", "username": "timbi"}
{"comments": [{"comment": "I asked the company several times, last time the pro told me that it's in security check, I don't know till when it will show \"under process\" . Thank you", "username": "Afi12", "commentId": "comment-7406976"}, {"comment": "Wait \"3 days\" my pal ...it will be Okay.", "username": "acchabaccha", "commentId": "comment-7406806"}, {"comment": "Ask your company PRO to check what the issue is", "username": "britexpat", "commentId": "comment-7406756"}, {"comment": "Be patient my pal .. It will be ok soon", "username": "muad-db", "commentId": "comment-7406746"}, {"comment": "Employment contract company should apply so u ask them ...", "username": "iswariya", "commentId": "comment-7406736"}], "question": "Hello, my employment visa was applied since the 4th of September till today it's showing \"under process\" on MOI site,  did anyone go through the same situation? ? And how long did it take for the visa to be issued.? I would be obliged if someone takes time to answer my questions. Thank you. ", "username": "Afi12"}
{"comments": [{"comment": "what happen ur visa", "username": "V.P.Kumar", "commentId": "comment-7417356"}, {"comment": "If salary 7000 above and less than 10000 than u should have company family accomodation and copy of rental agreement, so that easily u can apply", "username": "Aone1", "commentId": "comment-7407561"}, {"comment": "If you Don't have Company Provided housing, then the minimum salary MUST be 10,000 per month", "username": "britexpat", "commentId": "comment-7407461"}, {"comment": "Guys I want to apply for family RP...My profession is mechanical engineer..but my salary is less than 10 thousands..is it I am eligible to apply for family RP...?..yours reply will be appreciated...Thank you", "username": "ahmed farhan", "commentId": "comment-7407456"}, {"comment": "Me too confirmed u go to gharaffa submitting after approved . Finger print u can do in wakra tat I know", "username": "iswariya", "commentId": "comment-7407431"}, {"comment": "Iswariya, I have found the location bit I dialed a number frm immegration website and someone said only garaffa office accept application for famiky visa, so little bit confuse now, please confirm", "username": "Aone1", "commentId": "comment-7407316"}, {"comment": "U try in gharaffa and also khor ,, try near by wakra u may get", "username": "iswariya", "commentId": "comment-7407241"}, {"comment": "Iswariya, I tried to find out the details and got it but someone said we can submit our application only garaffa office, is it right?", "username": "Aone1", "commentId": "comment-7407121"}, {"comment": "It s near al meera...wakra You type wakra immigration center in Google map.. it s easy to find", "username": "iswariya", "commentId": "comment-7407061"}, {"comment": "Iswariya, Wakra location is near for me, can you please send me the exact location?", "username": "Aone1", "commentId": "comment-7407041"}, {"comment": "U can submit in al khor and wakrah branch", "username": "iswariya", "commentId": "comment-7407011"}, {"comment": "Thanks molten,", "username": "Aone1", "commentId": "comment-7406936"}, {"comment": "Iswariya, thanks Right, they can check with other papers for salary confirmation, do u have any information that only in garaffa is main office to submit application or any other also in qatar?", "username": "Aone1", "commentId": "comment-7406921"}, {"comment": "Go ahead my pal ....... hope for the best............ Good luck & joys for you ........... !!", "username": "Molten Metal", "commentId": "comment-7406916"}, {"comment": "Ur company providing family accommodation? Bcoz ur salary s 7000 ?", "username": "iswariya", "commentId": "comment-7406901"}, {"comment": "3 months bank statement too accepting so they l check your employement contract ur salary so they l compare , if not accepting u explain as before said ... mostly they l accept", "username": "iswariya", "commentId": "comment-7406896"}, {"comment": "Thanks britexpat, can they ask me to submit any other proff of deduction or may be not as in my contract and noc and the first 4 months salary is same.", "username": "Aone1", "commentId": "comment-7406766"}, {"comment": "The salary has to be 7000 or above for all six months. However, i suggest you submit and explain to them the reason for the deuctions - they may allow", "username": "britexpat", "commentId": "comment-7406761"}], "question": "Friends, Thanks for good support of my last query and this time i would like to know that if salary is QR. 7100/- and for first 4 months salary showing in the statement QR. 7100/- same as contract but last 2 months salary is QR. 6487/-  & QR. 6729/- because of leave deduction, so the point is with this staement immigration will accept the application for permanent family visa or wll approve it? Please provide the nessesarily information", "username": "Aone1"}
{"question": " ", "username": "Toolu"}
{"comments": [{"comment": "Please contact to Al-Muthana Security Services, Phone: 44355901, Mob# 55897382. Thanks,", "username": "mnandgadi", "commentId": "comment-7408431"}, {"comment": "Please contact to Al-Muthana Security Services, Phone: 44355901, Mob# 55897382. Thanks,", "username": "mnandgadi", "commentId": "comment-7408426"}, {"comment": "Please contact to Al-Muthana Security Services, Phone: 44355901, Mob# 55897382. Thanks,", "username": "mnandgadi", "commentId": "comment-7408421"}, {"comment": "Please contact to Al-Muthana Security Services, Phone: 44355901, Mob# 55897382. Thanks,", "username": "mnandgadi", "commentId": "comment-7408416"}, {"comment": "nope only those cameras which are approved by MOI can be used for commercial and residential puprose.", "username": "Justin John kanjiram", "commentId": "comment-7407256"}, {"comment": "Shouldn't all items being sold in shops be MOI approved ?", "username": "britexpat", "commentId": "comment-7407081"}], "question": "", "username": "Justin John kanjiram"}
{"comments": [{"comment": "Rizks .. You papadom.. You know that Khanan puts Nasvaar in/on everything.. So, I was going to ask the bakery to make some special ones with Nasvaar in them", "username": "britexpat", "commentId": "comment-7407411"}, {"comment": "britey you cheap rackoon...you will gift biscoots to Khanan on his birthday... ? :( He will surely accept Nasvaar .....:)", "username": "Rizks", "commentId": "comment-7407386"}, {"comment": "This is good news... I wanted to get some special biscuits for Khanan for his birthday", "username": "britexpat", "commentId": "comment-7407311"}, {"comment": "aswanika we get those biscuits in Lulu Hypermarket, I have seen it the other day....even the famous fruit biscuits of Karachi bakery are available there.", "username": "Rizks", "commentId": "comment-7407306"}, {"comment": "Can we get here Osmania biscuits made from Karachi Bakery hyderebad. if anyone have idea please share with me.", "username": "aswanika", "commentId": "comment-7407096"}, {"comment": "Rizks: MM is knowledgable about such things. Perhaps people come on tourist visa just to buy sweets from Al Mira ..", "username": "britexpat", "commentId": "comment-7406991"}, {"comment": "why not buy Batook Chewing gums...they are cheaper....:)", "username": "Rizks", "commentId": "comment-7406986"}, {"comment": "Nothing is cheaper here. Don't waste your time , go to some super market and buy.", "username": "Mufti Shahid", "commentId": "comment-7406981"}, {"comment": "Britey, but the world doesn't come to Al Meera to buy chocolates....:( Instead they will shop it from Veerapankuttyswamyranganathanpoobalanpillay's shop.", "username": "Rizks", "commentId": "comment-7406966"}, {"comment": "Rizks: yes, the globe - whole world.. Apparently , the sweets are even cheaper than in the shop of Mr and Mrs Venkatanarasimharajuvaripeta of Pondicherry", "username": "britexpat", "commentId": "comment-7406946"}, {"comment": "Globe ?", "username": "Rizks", "commentId": "comment-7406876"}, {"comment": "Al Mira, Wakrah, the best place on the globe ...............", "username": "Molten Metal", "commentId": "comment-7406851"}, {"comment": "If you go for cheap you will get Peanuts !", "username": "Rizks", "commentId": "comment-7406841"}, {"comment": "Lulu D Ring Road", "username": "muad-db", "commentId": "comment-7406836"}, {"comment": "LuLu hypermart", "username": "Lucky Luciano", "commentId": "comment-7406816"}], "question": "Someone please guide me where can I buy sweet (toffee,chocolates etc..) for lowest price, I am going on a vacation day after tomorrow and I want to buy lots of sweets .., some people suggested me IRANI SOQUE, and I checked inside there and seems price is expansive compare to LULU,", "username": "akramwahid"}
{"comments": [{"comment": "what are your timings like i know of a reasonable priced driver you could contact him @ mohd 55318824", "username": "elegal", "commentId": "comment-7408916"}, {"comment": "There are many companies that have taxis plying on the streets of Doha. Just try to talk to a few of them telling them of the timing for pick up and drop off and negotiate the price. You can then come into an agreement with one of them. Take the help of some of your colleagues who have been Doha for sometime.", "username": "acchabaccha", "commentId": "comment-7407741"}], "question": "Friends, recently i got a job offer and the company is located in Fereej bin omran. I moved to qatar recently and currently living in Al Wakrah with family. The company is offering accommodation and transport but that will be from the nearby place where other employees are residing.  I prefer to live with family in Wakra. I don't have driving license so can you guys recommend me mean of transportation from Wakra to Fereej bin Omran? Public transport will take a lot of time. Is there any taxi service available or something like that? Please help.", "username": "civil33"}
{"comments": [{"comment": "Hello. I heard a lot also about al khebra. my friends had lessons and test in there but I don't know. I also heard that nowadays, it is really not easy to pass the road test. even if you're driving in your home country more than 5 years, still you will fail. I guess when you are driving more than 5 years confidence and skills are there. That is why I am thinking of not to enroll again. anyway, thank you for all your comments. have a great day! :)", "username": "angel_hope", "commentId": "comment-7407866"}, {"comment": "Angel: Try Al-Khebra. I guess they have a pick up and drop facility available for certain areas. Also, driving a four- wheeler is totally different from driving a two-wheeler but some queries at QL are really interesting to read. As a fact, it is not the school that will help you pass the driving test. It all depends on your confidence and skills during the test.", "username": "acchabaccha", "commentId": "comment-7407516"}, {"comment": "Hi Lucky. That is why I am asking for some advice on which school I can enroll with. The one that will teach me well on how to pass the Road Test. Thank you for the comment.", "username": "angel_hope", "commentId": "comment-7407436"}, {"comment": "Go back to basics and start from Zero. You sound like someone who is not skilled enough to pass the Road Test at the moment.", "username": "Lucky Luciano", "commentId": "comment-7407421"}, {"comment": "Good to know that you've driven on highways here already .. You should sail through", "username": "britexpat", "commentId": "comment-7407356"}, {"comment": "Hi Molten. Honestly I don't have license in my home country though I drive car in our area only (not in crowded area though). I learned to drive in highways here in Qatar. I was just planning to shift to other schools as I had a bad experience in United Driving School especially during the Road Test. Thank you. :)", "username": "angel_hope", "commentId": "comment-7407341"}, {"comment": "Angel, That's great idea to go for a driving licence ......... Do you have any licence from your home country ........ Do you have any driving experience like a two wheeler experience from your home place ......... ?? ........ Past experience will help you in many ways ......... Good Luck to you Angel ....... !", "username": "Molten Metal", "commentId": "comment-7407331"}], "question": "Hi Everyone. Good day!   Can anyone advice me what driving school for ladies is best in Qatar? I was with United Driving School before and unfortunately I wasn't able to pass the road test only (and honestly, I don't know exactly why.) I am an expat - Asian and I am not sure if it may vary in getting a driving license. I want to change school as I don't want to waste more money in getting driver's license. I just badly need it because of my work schedule. (I am paying more money in taxi than my house rent.) Thank you for your suggestions. :)", "username": "angel_hope"}
{"comments": [{"comment": "List of Service Centers No.1 Musaimeer Service Centre (Musairmeer District) Services of General Directorate for Borders Passports and Expatriates Affairs Traffic Services Qatari Passports Fingerprint Service E-Government Branch Qatar National Bank Labor Dept. Branch No.2 Shahhaniyya Service Centre Services of General Directorate for Borders Passports and Expatriates Affairs No.3 Wakrah Service Centre Services of General Directorate for Borders Passports and Expatriates Affairs Nationality and Travel Documents Department's Services Fingerprint Service Qatar National Bank No.4 Al Khor Service Centre Services of General Directorate for Borders Passports and Expatriates Affairs Qatari Passports Fingerprint Service E-Government Branch Qatar National Bank Labor Dept. Branch No.5 Industrial Area Service Centre Services of General Directorate for Borders Passports and Expatriates Affairs Qatar National Bank Industrial Area No.6 Shimal Service Centre Services of General Directorate for Borders Passports and Expatriates Affairs. Nationality and Travel Documents Department's Services Fingerprint Service Near Shimal Police Station No.7 Post Office Service Centre Services of General Directorate for Borders Passports and Expatriates Affairs Post Office Main Building at Doha Corniche. No.8 Hamad Medical Corporation (Beside Out Patients Clinic). Services of General Directorate for Borders Passports and Expatriates Affairs. Nationality and Travel Documents Department's Services. Traffic Services.", "username": "Sheen Services WLL", "commentId": "comment-7408516"}, {"comment": "Yes sheen services, please provide the details", "username": "Aone1", "commentId": "comment-7407556"}, {"comment": "Sheen services 7000 salary scale rule came na plz tel about that", "username": "iswariya", "commentId": "comment-7407551"}, {"comment": "If salary is 7100 so that we can apply?", "username": "Aone1", "commentId": "comment-7407536"}, {"comment": "Dear Sir, Current process in Family permanent visa: 1. NOC & salary letter from Employer -salary overall to be minimum 10,000 QAR 2. Copy of your passport and Qatar id. 3. Copy of your Education Certificate (Attested) 4. Wife's Passport Copy 5. Marriage Certificate (Attested) 6. Child(s) Birth Certificate(s) (Attested) 7. Rent agreement duly attested by municipality (municipality shall require another set of documents like copy of title, copy of owner QID, lay out, etc. for stamping) 8. Six Months bank statement signed & sealed by bank manger Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7407486"}], "question": "Can anyone please tell me that immigration offices details in qatar for family visa?", "username": "Aone1"}
{"question": "I would like to seek for your advice regarding to the following concerns; My starting date is from Oct. 4 2014 and it will end up in Oct. 4 2016, but I've filed an emergency leave last march 1 , 2016 and went back here in qatar on april 11 2016 and filed again on May 17 2016 until August 27, 2016, now I've decided to not renew my contract so i will declare end of service. Since im not continuing my contract and decided to extend for another 3months to cover up the time that I went an emergency leave so the total of my service will be 22 months which is less than 2 months; can i still get my 42 days of annual paid leave or the balance 2 months will be deducted? Some says that they will only pay the 21days since im less than 2 months to complete my 2nd year. how can i compute my gratuity for 22 months?  ", "username": "senpaicloud"}
{"question": "i am working as accountant i need to calculate the leave salary of an employee have 5 to 6 absents per month without notice how to adjust these absents while calculating his leave salary. we calculate 21 days of leave salary per year ......... ", "username": "Q Pak Builders 2016"}
{"comments": [{"comment": "Thanks for the suggestion mate, but neither of these had it. Fortunately found one in MES library in Barwa Village.", "username": "qatar_a_wonderful_country", "commentId": "comment-7402291"}, {"comment": "Try Jarir Book Store or Lulu D Ring Road my pal", "username": "muad-db", "commentId": "comment-7402256"}], "question": "Guys, I am in need of A3 Flip File urgently for school project.....I have looked in almost every library in Doha. If anyone knows a place where I can get it, please do let me know in the comment section. ", "username": "qatar_a_wonderful_country"}
{"comments": [{"comment": "Dear Sir, Go to Garafa Immigration dept, meet the Captain request for extension providing him with a valid reason, He might accept or may deny...Good Luck Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7402971"}], "question": "Dear All, I got the visiting visa for 16 days for   and one month for my  . I need to extent into one month my kids visa. can anyone can advice?  visa can be Extendable for kids? if extenble where I want to do payment? without paying overstay charges in airport, kids can go, as mom having a valid visa?        ", "username": "Danielrc"}
{"question": "I am on open ended contract and I have been completing 1 year and 8 months when I'm leaving, I want to know few things if any one could help me will be very helpful. Will my gratuity and vacation money will be calculated for 1 year and 8 months of service period if I have not taken my vacation ? What will happen if I have been gone on LOP for few days then how it will be calculated ? Since I am on open ended contract will I be getting the Air Ticket back to home destination ? Since I have competed 1 year and 8 months and I will be planning to go on February 2017 but my visa will expired on month of May, Will they deduct any charges from me ?    ", "username": "Rukshan mark"}
{"comments": [{"comment": "Thanks! Haven't thought of that. Will definitely keep a lookout and on the plus side I love fuul, so I wouldn't come back empty handed!", "username": "Heba2016", "commentId": "comment-7403536"}, {"comment": "Have you tried any of the local eatires that bake there own bread? I've seen the bricks your talking about at a Resturant off of TV round about. They make the best Ful in Doha and there fresh baked bread straight from there oven is amazing!!", "username": "armor10", "commentId": "comment-7403391"}], "question": "Need to find fire clay bricks to make a pizza oven. So far the local brick company only makes red clay bricks - They've assured me they would work but through extensive internet research they wouldn't last very long and wouldn't retain as much heat as firebricks for a pizza oven. Firebricks are beige in colour (which also helps with distributing light rather than the red bricks) and according to their composition - Would need one that has an alumina % between 20% to 30% and a high percentage of silica. So far, the nearest firebrick manufacture is in Saudi and they only produce bricks of 40% alumina :( {which would be bad for the pizza oven as a higher rating = higher heat conduction = uneven baked pizza with burnt bottom} The rest of the materials needed are easily available but having a hard time finding firebricks. If y'all know of anyone who has build their own ovens here in doha through local supply, would really appreciate some info.", "username": "Heba2016"}
{"comments": [{"comment": "Dear Ma'am, Greetings of the day!!! You are always welcome. Dear iswariya, Thanks and very appreciative for your support. Warm regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7405041"}, {"comment": "Thank you to Sheen services- i finally received my email and my queries have been resolved.", "username": "ms_g86", "commentId": "comment-7403721"}, {"comment": "Dear Ma'am, Greetings of the day!!! We have replied to your mail and we are once again apologetic for the belated reply. Thanks & warm regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7403511"}, {"comment": "being a big group doesnt mean they cant give bad service fortunately i dont need to explain anything there are emails as proof!!!", "username": "ms_g86", "commentId": "comment-7403441"}, {"comment": "How it s possible, sheen services big group na ... be carefull .., they are really helpful to all people for advice", "username": "iswariya", "commentId": "comment-7403436"}, {"comment": "lets hope i will not wait in vain!", "username": "ms_g86", "commentId": "comment-7403426"}, {"comment": "Dear Sir, Greetings of the day!!! We are very appreciative of you for sending us the inquiry. We will reply back to you as soon as possible. Thanks & warm regards, Sheen Services WLL", "username": "Sheen Services WLL", "commentId": "comment-7403386"}, {"comment": "I resent the email - so you can pretend to not receive it again.", "username": "ms_g86", "commentId": "comment-7403371"}, {"comment": "Dear Sir, Can you please give at least first four alphabets of your email address to track down your communication? Thanks & warm regards, Sheen Services WLL", "username": "Sheen Services WLL", "commentId": "comment-7403361"}, {"comment": "Dear Sir, Can we please give at least first four alphabets of your email address to track down your communication? Thanks & warm regards, Sheen Services WLL", "username": "Sheen Services WLL", "commentId": "comment-7403356"}, {"comment": "HAHAHA ok youve just lost business! and whoever has that number is lying - straight LYING!", "username": "ms_g86", "commentId": "comment-7403351"}, {"comment": "Dear Sir, We checked PRO@SheenServices.com inbox but not able to find any un-replied mail. We even filtered using keyword \"ms_g86\" but to no avail. We have questioned the current staff you receive call on 70204280 but he is able to recall having rude conversation with any caller. Thanks & warm regards, Sheen Services WLL", "username": "Sheen Services WLL", "commentId": "comment-7403346"}, {"comment": "thats ridiculous surely whoever is manning the acccount knows that they havent replied to the email? its really easy- there is sent items and inbox- if there is an email in the inbox and not an outgoing message in the sent box- THATS MY EMAIL THAT HASNT BEEN REPLIED TO. I wont visit your offices i just need a reply to my email- bad business really.", "username": "ms_g86", "commentId": "comment-7403326"}, {"comment": "Dear Sir, Can we please have your email address to track down your communication? We shifted to new building, in which the contractor forgot to do block wiring. The building management is working on it. The moment infrastructure is in place, Ooredoo will do their part. You are humbly invited to visit our office. Thanks & warm regards, Sheen Services WLL", "username": "Sheen Services WLL", "commentId": "comment-7403311"}, {"comment": "can whoever mans this email address and telephone number please get back to my NUMEROUS emails: that landline number does not work PRO Services Division M: +974 - 7020 4280 T: +974 - 4037 7890 E: PRO@SheenServices.com", "username": "ms_g86", "commentId": "comment-7403281"}, {"comment": "Dear Sir, We our self are shocked to read this comment. Please accept our sincerely apology for the same. Can you please give the mobile no. of the person who was rude to you? Our website is www.SheenServices.com Regards, Sheen Services WLL", "username": "Sheen Services WLL", "commentId": "comment-7403276"}, {"comment": "I would like to give them an opportunity to 1st rectify this situation it could be an honest communication mistake. So i wait ........", "username": "ms_g86", "commentId": "comment-7403216"}, {"comment": "please share your experience with them so that readers can be forewarned and admin of this site will be aware as well...", "username": "zafirah", "commentId": "comment-7403206"}, {"comment": "Yeah thats where i got the details from because i had seen them comment on a lot of posts so i assumed they know their story- BUT alas seems its a farce. I have sent emails and called and like i said this guy was super rude.", "username": "ms_g86", "commentId": "comment-7403186"}, {"comment": "there is someone on QL by that ID SheenServices...maybe he can help ?", "username": "Rizks", "commentId": "comment-7403126"}], "question": "not only do none of the websites work - the guy i just called was thee rudest human being ever!! is there someone that wants to work in the PRO division that can get back to me?", "username": "ms_g86"}
{"comments": [{"comment": "hello sir if ud like a family visa assistance u may free to call me for any details and information hir is my contact number.66957271.thank u.angel", "username": "Alostoora Travel and Tourism", "commentId": "comment-7401556"}, {"comment": "Family residential visa", "username": "iswariya", "commentId": "comment-7400246"}], "question": "", "username": null}
{"comments": [{"comment": "Dear Lulu Team,. Your success is your employees. Please help them fast.", "username": "mohamed800", "commentId": "comment-7400896"}, {"comment": "Sujan: Who would you like to believe? Comments of 3 sensible persons or the one from a person who writes for the sake of writing. He asked you to be patient till the manager finishes solving his family problems! Ha! Ha!", "username": "acchabaccha", "commentId": "comment-7400231"}, {"comment": "Sujan ... Be patient my pal ... Perhaps tge manager is ill or has family problems ...", "username": "muad-db", "commentId": "comment-7400191"}, {"comment": "Dear Sir, Before wasting any time report to National Human Rights Committee (NHRC) along with the relevant documents to put forward your issue. Location: 25°20'04.2\"N 51°29'11.9\"E Al Markhiya St, After Dahl Al Hamam Park signal, Road from Landmark Shopping Mall to University Road(Al Jamiaa Street) Now NHCR is under Ministry of Interior therefore police is managing it. They will call your company owner to report to them. If problem is not solved at their end then they will escalate it to Labour court. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7400171"}, {"comment": "Perhaps someone from Lulu management would like to comment", "username": "britexpat", "commentId": "comment-7400146"}, {"comment": "I am really surprised that an organization such as LuLu would be doing something like this. Suggest you go to Human Rights office and seek their guidance. They will help you out. .", "username": "acchabaccha", "commentId": "comment-7400111"}, {"comment": "It is illegal for them to keep your passport . Go to the human rights commission .. Why would a company like act I such a manner ?", "username": "britexpat", "commentId": "comment-7400096"}], "question": "", "username": "Sujan Tamang"}
{"comments": [{"comment": "If you play THEIR game you will lose.", "username": "Wild Turkey", "commentId": "comment-7404051"}, {"comment": "It is difficult to say .... I haven't heard of deprtations for such incidents .. It mainly depends on what the other party complained about .. were you informed of anything ? I think it best to consult a lawyer and get feedback ...", "username": "britexpat", "commentId": "comment-7404046"}], "question": "Apologies for the longish post. Hands up in the air, I did a stupid thing. I got into a slight road rage incident with a local on the Doha Expy which commenced with me being tailgated by a 4x4, cut off by him, then me doing the same resulting the bird being flicked at home. He then tried to push me off the road and during my defensive driving another car joined the assault and proeeded to follow me for a good 30min until police joined (I can only assume he was talking to the police the whole time). I was joined in the car by a traffic policeman and escorted to the North Traffic Dept station. Nothing was said to me. Waited 15min and then told to leave after I got my IDs back. 5 days as now passed and today I got a call from my car rental company that I had to attend traffic court. No specific date, just that I had to go.   What is the likely outcome of this? Do I need a lawyer? I know of the harsh penalties, but are they likely to push for jail or deportation for this (my first and only offence and Ive only been in the county 6 weeks). S**ting bricks here. Any advice? Cheers!", "username": "jbflyguy84"}
{"comments": [{"comment": "Thank you all", "username": "Zam Zam", "commentId": "comment-7406326"}, {"comment": "Thanks, Teacher .....................................................", "username": "Molten Metal", "commentId": "comment-7403996"}, {"comment": "Dear Sir, Please visit our office. Address : Office # 202, Second Floor, Concord Business Center, Al Rawabi Street, Near C Ring Road, Al Muntazah, Doha, Qatar. Office Timings : Sat-Thu: 8:00 AM to 8:00 PM Thanks & warm regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7403456"}, {"comment": "Bro, you can buy in Al Nasser next to Buriyani Corner 10 Lts - QR 50", "username": "Teacher_SL", "commentId": "comment-7403431"}], "question": "Hi. I need some   Water... Can anyone let me know where I can buy? or Someone help me with 2 or 3 Litres. Before I purchased from a travel agent but now they are not selling. Thanks in Advance... Zam Zam", "username": "Zam Zam"}
{"comments": [{"comment": "Abi my pal .. We all make mistakes .. An antelope will not forsake its mate just because another enters the jungle", "username": "muad-db", "commentId": "comment-7400181"}, {"comment": "As sponsor , you can cancel anytime - divorced or not", "username": "britexpat", "commentId": "comment-7400141"}, {"comment": "i want her back to home country....do i have the right after divorce?", "username": "Abi1", "commentId": "comment-7400116"}, {"comment": "Why not just get her to transfer to her employer's sponsorship", "username": "britexpat", "commentId": "comment-7400106"}], "question": "", "username": "Abi1"}
{"comments": [{"comment": "Dear Sir, Profession change application form and fill up with new profession along with company stamp and sponsor signature 1) Copy of Company computer Card and municipality certificate 2)Copy of Sponsor ID Card 3) Electricity bill 4) Your Education certificate Copy (Translated to arabic) 4) Bank Statement(6 months) 5) New three Labour Contract with new profession 6) Copy of Current Labour Contract 7) Your Passport and ID card copy Go to labour department in the C Ring road near by American hospital, submit above papers. With the submission receipt and all of application forms, go to 3rd floor officer Mr Abdullah and get signed on the application form. (He will advise you if any changes is required on the application form) After getting officer signature, Please go to the next building where new labour contracts are attesting, submit all of the papers along with the new contracts. You will have to pay 50 or 60 QR for new labour contract attestation. After these steps you will have one attested new labour contract and the same previous submission receipt. Now you wait for another 7 days , In the mean time get a new ID application form filled up and go to Garaffa immigration department building No 1, first floor , show your receipt , they will check and if your papers are arrived you will get one signed paper. With this paper, new ID card form and original passport submit in the ground floor where visa stamping on passport. Pay 300 QR then you will get visa stamped with new profession and ID card. Best of luck Regards, Sheen Services WLL www.sheenservices.com", "username": "Sheen Services WLL", "commentId": "comment-7400166"}], "question": "is it possible to change profession from driver to Engineer?", "username": "john9999"}
{"comments": [{"comment": "on a serious note... Get it repaired but would be expensive and time consuming and one cannot trust the works done on american cars by local garages. Else sell it as written off car for spare parts. you might get 1000 to 1500 QAR", "username": "qatar_a_wonderful_country", "commentId": "comment-7403451"}, {"comment": "or drive backwards!!!!!!! ;)", "username": "qatar_a_wonderful_country", "commentId": "comment-7403446"}, {"comment": "None would buy a car with a failed gear, and repairing of gears is also expensive and difficult. You may put it up as \"Free\" or check with any scrap yard.", "username": "Equin0x", "commentId": "comment-7400306"}], "question": "I will sale my car as per condition transmission not working and esteemara expired sept 2016. Please advise", "username": "sayb4be"}
{"comments": [{"comment": "Right '' don't use Agape '' from today .....................................", "username": "Molten Metal", "commentId": "comment-7403956"}, {"comment": "Did you get hold of any shipping documents from them my pal? If yes, then you have a case against them. If they were shipping your consignment by sea, you may be able to find out the status of your shipment by contacting the agent of the shipping company or the airline if you were getting the shipment through air my pal. Have any of your colleague or friend in Doha call on them to find out the status my pal. Hope this works out in your favour my pal.", "username": "acchabaccha", "commentId": "comment-7403706"}, {"comment": "We will be careful .. Contact their manager and speak kindly to him", "username": "muad-db", "commentId": "comment-7403666"}, {"comment": "Thanks for the heads up .. Sorry to hear of your plight. Hope someone from Agape reads this and responds ... \"They seem professional enough until they've got your money but after that - hallas...\" - applies to many companies here ;O(", "username": "britexpat", "commentId": "comment-7403601"}], "question": "This is an urgent warning to everyone who lives in Qatar! Please share widely. Do NOT use Agape International to do your shipping! I have nothing but trouble because of them. THREE months ago they came to my house in Doha to pack my things, take them away and receive the payment from me. They were on time that day but had to be supervised and all calculations had to be double checked, as they made a mistake that would have cost me more than 1,000 extra. Since then I haven't received any documentation or even an ETA. Nothing. Despite many phone calls, visits and emails by myself, friends in Doha and even a lawyer, I only got a couple of emails promising me I'd receive something the next day but then again nothing.  Please, if anyone is moving out of Doha any time soon, make sure they don't use Agape. They seem professional enough until they've got your money but after that - hallas - you never hear from them again. I don't know if I'll ever get my stuff. I think the next step is to call the police. But please share this to save others the trouble! Thanks.", "username": "cazei"}
{"question": "Does anyone knows good, affordable and average gym in Al Thumama Area. ", "username": "tasali"}
{"comments": [{"comment": "thanks VP Kumar and acchabaccha for information", "username": "rakeshsaini31", "commentId": "comment-7401786"}, {"comment": "Example:U c if u r applying and got visa after entry u shd do medical after fit message coming u can extend upto 5 mon the thru app metrash easily,,,", "username": "V.P.Kumar", "commentId": "comment-7400616"}, {"comment": "The choice is all yours. You could do at one single time for the entire 5 months or for one month each depending on your own convenience.", "username": "acchabaccha", "commentId": "comment-7400486"}], "question": "Hello friends, I am aware that family visit visa which is basically for one month period can be further extended upto 5 months for immediate family members.    can  I make extension 5 times each time one month ? or I can apply extension only once irrespective of  1 month or 5 month ?", "username": "rakeshsaini31"}
{"comments": [{"comment": "thanks VP Kumar for information", "username": "rakeshsaini31", "commentId": "comment-7401791"}, {"comment": "U can c Inow hamad hospital in low price medical lyk 5 riyal maximum", "username": "V.P.Kumar", "commentId": "comment-7401021"}], "question": "Hello friends, My wife en daughter r here on visit visa and will stay longer on extension. what r various options for medical facilities when required ? like insurance card or economical clinic or govt hospitals etc ?", "username": "rakeshsaini31"}
{"comments": [{"comment": "Ask him to discuss it with his employer. If required, the correction could be made within one day.", "username": "acchabaccha", "commentId": "comment-7400516"}], "question": "Hey guys one of my new mates who is Algerian and expected to arrive soon to Doha has a problem his work visa has been issued and it seems perfect but only his first name in the Arabic section his first name there was typed without its last letter does it considered a big deal and need to be fixed ?? or the English data in the issued visa ((which are all perfect and well-matched in compare to his passport data)) are officially enough for the customs and airport officials ? thanx", "username": "andrea1995"}
{"question": "Dear Sir /Madam,", "username": "rikrikas"}
{"comments": [{"comment": "ford regular service and maintenance such as oil change and break pads, filters.... are very reasonable, i would say same as toyota and nissan", "username": "Saeed Khalid Shahrour", "commentId": "comment-7397771"}, {"comment": "A new car will usuually have one/two years free servicing - check with dealer", "username": "britexpat", "commentId": "comment-7397021"}, {"comment": "Dear Sir, Please check with the Ford showroom. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7396941"}], "question": "Dear All, Need help on how much would be the maitnaence cost estiamte for a new ford sedan (fusion).I mean for regular service minor and major for next 2 years.It would be used for home to office and and office to home..and small weekend inside city travel.", "username": "Cooldude007"}
{"comments": [{"comment": "Dear Sir, For any legal issue you can send us your contact number via email: (mohammad.j999@gmail.com). Best Regards Law Firm", "username": "honest_man5", "commentId": "comment-7405641"}, {"comment": "Well done Q Living for intervening ....", "username": "britexpat", "commentId": "comment-7403946"}, {"comment": "Villa partition is illegal, so they cannot issue contract to you. Just warned them you are going to report the matter to Baladiya/Police for fraud. They already encashed your cheque for 2 month rents that proof is enough to show they have sub-rented the villa to you illegally.", "username": "Q Living", "commentId": "comment-7403936"}, {"comment": "WT, it's normal 'cause the tenant is the one to sign first - then the owner (which is not always available in the office) - within a week they should give you a copy.", "username": "zafirah", "commentId": "comment-7403801"}, {"comment": "How come you signed a contract and did not take a copy? It is incredible how stupid some people are!", "username": "Wild Turkey", "commentId": "comment-7403711"}, {"comment": "Send us an email with the name of the company and their contact details - support@qatarliving.com", "username": "qatari", "commentId": "comment-7403551"}, {"comment": "You can take the matter to the Rental Disputes Office located near Holiday Villa on the C Ring road. It appears you came into contact with the wrong people.Report the matter to the police and the above office if you have documentary proof of payment.", "username": "acchabaccha", "commentId": "comment-7403541"}, {"comment": "Go to the police and file a complaint - do you have any proof of the conversations or exchanges ?", "username": "britexpat", "commentId": "comment-7403516"}], "question": "Hi All,   I am new to Qatar and I rented out a Studio accommodation (Villa Partitioned) in Aug 1st through a real estate company. They told me to come to office for signing contract and they offered me a contract which I signed same day. Then they got one month cash security deposit and also I paid August month rent in cash and given them an 11 cheques for remaining months. But they said they will give me the signed contract in few days. Then I was keep calling them and visited few days their office and they were acting like they could not find the signed contract in their office. Since I could apply for internet and any other services without a contract on my name, I was staying in old location paying them also monthly rentals. I chased the real estate company till Sep 30th for signed contract, But they never give it. So I decided to withdraw my relationship with them and I informed them that I need my remaining cheques but still agreed to pay them Oct rent also even I did not stay there for at least one day and wasted 3 months rentals.  My contract is saying that Notice period is 2 month. But the real estate company said you should stay at least 6 month by having the whole fault on their side. Then I spoke to manager and he said give me 1 day to give you a feedback but never give me a feedback. Please share your experience and how I can bring this case to Police and Baladhiya if they are not willing to settle this in a reasonable way?", "username": null}
{"comments": [{"comment": "Check QL Classifieds / Pages", "username": "britexpat", "commentId": "comment-7398186"}, {"comment": "Dear Sir, 1, Noble International School 2, Acorn Nursery 3,Park house English school Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7398181"}], "question": "Can someone suggest me a good nursery school for  a 3 yr girl. In abu hamor,ain khalid...how much it cost and the teachings", "username": "juscool03"}
{"question": "   ", "username": "hitendrab"}
{"comments": [{"comment": "WT & Brit, You can not stop honey bees from visiting a farm full of fresh scented flowers ...... .........", "username": "Molten Metal", "commentId": "comment-7397581"}, {"comment": "Glutton for punishment I believe", "username": "britexpat", "commentId": "comment-7396796"}, {"comment": "The question is: why would you experience the same ordeal again? Do you think Qatar will ever change? You should be glad that you got out without being imprisoned.", "username": "Wild Turkey", "commentId": "comment-7396771"}, {"comment": "Dear Sir, Not possible. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7396751"}], "question": "Hi friends! Is it possible to come back again if someone exit the country on 3 months grace period?  Also, if someone have expired visa & can not paid the money; can they exit without paying it? Can they visit again?      ", "username": "sinan57"}
{"comments": [{"comment": "He said... His employer did not even give the passport... Employer told... passport is not with him. After he file the case and got rejected he left the country with oneway travel document He is in a situation to come for some earning... he believes while he has Qatar licence he can find a good job easily.", "username": "Zam Zam", "commentId": "comment-7397791"}, {"comment": "There is always a way my pal .. Write a letter to your sponsor with kind words", "username": "muad-db", "commentId": "comment-7397026"}, {"comment": "Dear Sir, He is better to stay in home country. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7396946"}, {"comment": "Why risk coming back ? The owner may have listed him as an absconder ... The only option is to apply for a visa and see if it gets accepted", "username": "britexpat", "commentId": "comment-7396801"}], "question": "I need your advise on behalf of a known person One of my known person request me to find an answer for him, therefore I am here in QL. I believe QLers may answer   He worked in Qatar few years back (More than 3 years) he worked as a driver at a local house. He did not get salary on time and employer was offensive all the time. then he dcided to leave the country. prior to leave the country, he made a case in court against the employer. (he even didn't have an approved Contract) Court rejected the case.   then straight away he left the country.   Now he scared of coming back assuming that his employer may have filed any case against him.   Can anyone advise on this?  ", "username": "Zam Zam"}
{"comments": [{"comment": "Dear Sir, PLease call to Sarvodaya Nursery Bin Mohamoud: Saeed Bin Suhail St,Doha, Qatar Al Hilal:Mohammed Bin Majah St ,Doha, Qatar Phone: Play School: +97-4447 9173 Phone: Kindergarten: +97-4037 1018 Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7398196"}], "question": "hi, i'd like to ask if anone knows a nursery which opens till late maybe 9 pm ? thnx", "username": "bobbzzyy"}
{"question": " Hello, Does anyone have any experience of second round IVF procedure in HMC.? 1. How many months they take for starting treatments between 1st and 2nd. 2. Does Hospital do any examine for 1st failure? 3. Do they provide any test results etc.? Appreciate if someone can share theseinformation.", "username": "ahk2013"}
{"question": "What do LinkedIn 1st, 2nd, 3rd degree connections mean? On LinkedIn, people in your network are called connections and all of your connections are your 1st degree connections. People connected to your connections but not directly with you are your 2nd degree connections. 3rd degree connections are friends of your friend’s friends. LinkedIn is giving you quick information regarding a connection to measure how closely related this connection to you. Well basically your network is made up of your 1st-degree, 2nd-degree and 3rd-degree connections. Here is the breakdown that might make more clear sense on this..  are connections made of people you're directly connected to. May be you have accepted their invitation to connect, or they have accepted your invitation for connection. The   degree icon next to their name in search results and upper right hand corner of their profile.     can be reached by sending a message on LinkedIn.    made of people who are connected to your 1st-degree connections. You'll see a   degree icon next to their name in search results and on their profile. You can send them an invitation by clicking   or contact them through an InMail or an introduction.  are made of people who are connected to your 2nd-degree connections. You'll see a   degree icon next to their name in search results and on their profile. If their full first and last names are displayed, you will be able to send them an invitation by clicking  .    These people are considered part of your network because you're members of the same group. You'll see a   icon next to their name in search results and on their profile. You can contact them by sending a message on LinkedIn or using your group's discussion feature.  LinkedIn members who fall outside of the categories listed above. You can contact them through an InMail. Mohammad Shahadat Hossain IT Engineer Email: Phone: 77296272", "username": "shahadat.hossain"}
{"comments": [{"comment": "Rizks.... zafirah shared an old picture of yourself before that garlic incident :o( [IMG]", "username": "britexpat", "commentId": "comment-7398796"}, {"comment": "Mufti, instead of Onion - someone suggested me of Garlic....and I ended up BALD ! :( Damn that Dracula. Sigh", "username": "Rizks", "commentId": "comment-7398726"}, {"comment": "Rizks,..why didn't you post about you losing your hair before you went bald... You would have got the advice of Onion therapy earlier. Anyway it is too late now :-)", "username": "Mufti Shahid", "commentId": "comment-7398686"}, {"comment": "Timbi, I made one Forum on Dandruff Removal with One ONION ..... may be about a year back, you may search my Topics ........ Thanks ......", "username": "Molten Metal", "commentId": "comment-7398661"}, {"comment": "Brit, We need to make sure the culprit dandruff remain scared from the half ONION waiting in the soap case ...... ...... ....", "username": "Molten Metal", "commentId": "comment-7398656"}, {"comment": "britey, maybe the other half thambi can use it to prepare Fish Vindaloo.....:)", "username": "Rizks", "commentId": "comment-7398651"}, {"comment": "MM: If timbi's only using half and onion, then why borrow a whole onion from the poor neighbour ?", "username": "britexpat", "commentId": "comment-7398636"}, {"comment": "britey, you muppet - how can wearing a black shirt stop the dandruff on the head ? :( Thumbi, shave off your head....simble !", "username": "Rizks", "commentId": "comment-7398631"}, {"comment": "Timbi, I have a home tip for you ......... You may laugh at it as well ........ it is good for our general health ...... . All you need to do is borrow an ONION from a neighbour ....... why borrow because I wish to clear the dandruff from your hair with ZERO expenses ..... No need to get robbed at the pharmacies ..... Cut the ONION into 2 equal pieces ..... that's all ...... Now rinse your hair with normal tap water then scrub the half cut ONION on to your scalp, a little hard , at the roots of the hair ..... for 3 minutes ..... then you may use the shampoo which you use presently...... wash the hair in a common way ........ You will see the Dandruff disappear with half ONION only ......... No side effects at all .......... Do it after 3 days if you don't want to see the dandruff again ....... or you may relax .... and use the onion at your scalp on the next week end again ...... use other oils as normal as you wish ...... Give me feed back after two washes & forget me after 3 washes ........... Good luck & joys ............", "username": "Molten Metal", "commentId": "comment-7398586"}, {"comment": "Mufti: Rizks is a perfect example. timbi: Just go to the nearest pharmacy and buy some anti-dandruf shampoo and don't wear a black shirt", "username": "britexpat", "commentId": "comment-7398546"}, {"comment": "Dont worry, people go bald very fast in middle east.", "username": "Mufti Shahid", "commentId": "comment-7398541"}, {"comment": "Try natural aloe vera.", "username": "Kadeeja Jamsheed", "commentId": "comment-7398506"}], "question": "Hi Friends, I am suffering of dandruff because of the water here.How i can cure that. Anyone have any suggestions,Any medicine.  ", "username": "timbi"}
{"comments": [{"comment": "https://www.glassdoor.com/Reviews/qatar-reviews-SRCH_IL.0,5_IN199.htm", "username": "britexpat", "commentId": "comment-7398736"}], "question": "I have heard that most of the contracting/engineering companies force their employees to work 10-12hr/day without paying OT. I would like to know companies which are best to work at?(not only salary,but also based on management employee relationship and best work culture)", "username": "Muhammad Afnan 1994"}
{"comments": [{"comment": "You will face rejection in the first time itself. Your profession shall match with your ID. i.e. if you are an Engineer, it should match as an Engineer (related discipline) in the ID.", "username": "ani_chy", "commentId": "comment-7399386"}], "question": "Hey QL friends I wanna know can i give UPDA engineering exam while I have home visa not company visa and my profession in QID Is driver ", "username": "Noor bangash"}
{"comments": [{"comment": "@armor, Thanks mate, Yes one of my relatives friends going to US that's why i am planning to buy it there to save something otherwise i will buy here only.", "username": "GANESH HEMANTH", "commentId": "comment-7399856"}, {"comment": "Unless you know someone going to the US and is willing to buy it and bring it back with them. Your not saving any money. By the time you order it and have it shipped here. It's about the same price as if you walked into a shop and bought it here. Also your taking the chance of having it damaged in shipping. Do though spend the extra cash for the Apple Care. If you ever need a reapair it will save you much more then you paid for it.", "username": "armor10", "commentId": "comment-7399571"}, {"comment": "@armor, Thanks for your information, I don't have any problem with arabic keyboard but am guessing somehow cheaper than here buying in US. Is it true.?", "username": "GANESH HEMANTH", "commentId": "comment-7399566"}, {"comment": "@armor, Thanks for your information, I don't have any problem with arabic keyboard but am guessing somehow cheaper than here buying in US. Is it true.?", "username": "GANESH HEMANTH", "commentId": "comment-7399561"}, {"comment": "Thanks mate for your comment. is there any cost comparison when buying there.?", "username": "GANESH HEMANTH", "commentId": "comment-7399546"}, {"comment": "I assume that it must be to do with the price.... Probably cheaper in the USA", "username": "britexpat", "commentId": "comment-7399536"}, {"comment": "No issues with the Warentee. My MAC is from the US, and as long as you take it to the authorized Apple Repair shop off of Salwa road. Your Apple Care is totally valid. My question is why don't you want a Mac from here? Do you not want the Arabic Keyboard. There literally is no difference other then that.", "username": "armor10", "commentId": "comment-7399526"}, {"comment": "No issues with the Warentee. My MAC is from the US, and as long as you take it to the authorized Apple Repair shop off of Salwa road. Your Apple Care is totally valid. My question is why don't you want a Mac from here? Do you not want the Arabic Keyboard. There literally is no difference other then that.", "username": "armor10", "commentId": "comment-7399521"}, {"comment": "No issue with voltage because the adapters should accept 110-240 .. However warranty may be an issue", "username": "britexpat", "commentId": "comment-7399306"}], "question": "Dear All, I am looking to buy MacBook from USA, Is it worth to buy it from US,.? can i save something if i buy the same prodcut in US..? Is there any voltage issue if i use US prodcut in Qatar because in USA they use 110 volts power.  Please advise. Thank you", "username": "GANESH HEMANTH"}
{"comments": [{"comment": "Dear Sir, Health Effects of Smoking - try to avoid for tobacco smoking Smoking also causes the following cancers3 Acute myeloid leukemia Bladder cancer Cancer of the cervix Cancer of the esophagus Kidney cancer Cancer of the larynx (voice box) Lung cancer Cancer of the oral cavity (mouth) Cancer of the pharynx (throat) Stomach cancer Cancer of the uterus Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7398226"}, {"comment": "My Cuban Shotputter used to smoke a Clay Pipe.. I would often mix the tobacco for her and we would share a romantic puff - Good times", "username": "britexpat", "commentId": "comment-7398161"}, {"comment": "Try Lulu D Ring Road my pal .. You will have joys", "username": "muad-db", "commentId": "comment-7398156"}, {"comment": "City Center Villagio Landmark I think tats a normal pipe available almost everywhere, don't u go out from your room ?", "username": "Rizks", "commentId": "comment-7398151"}], "question": "Does anybody know from where I buy Tobacco Pipe in Qatar. ", "username": "tasali"}
{"comments": [{"comment": "If you have an iphone then iCloud will take care .. Otherwise just use a USB or external hard disk", "username": "britexpat", "commentId": "comment-7399301"}, {"comment": "External Memory USB FB...etc....", "username": "Rizks", "commentId": "comment-7399251"}], "question": "how to save/backup pics of my trip while travelling and what is the best way to save pics. Please let me know.", "username": "tasali"}
{"comments": [{"comment": "Because as per Qatari Law, change of sponsorship cannot take place before one year.", "username": "Mufti Shahid", "commentId": "comment-7399416"}, {"comment": "Can you tell me the reason why I cant change before one year, because our sponsor told me one week ago that if you want to go to another company then go. he will give whatever document I need to change to that company", "username": "minnysantos", "commentId": "comment-7399391"}, {"comment": "Its not possible right now. so you have to wait after one year....BOSS", "username": "MUSTHAFA.Y.", "commentId": "comment-7399351"}], "question": "I have joined a company since one month but not satisfied. So i would like to transfer to another company. my company is ready to give any help and any document required. What is the process and what are the documents required. I have just got my company RP yesterday Please answer soon as i am getting a few offers and have to decide soon", "username": "minnysantos"}
{"comments": [{"comment": "It is done through Return Permit service in Metrash 2. Check if it is active on your metrash, in my case it was not and my mandoob got it activated at Airport Immigration Dept. He took my passport copy and my ID copy. Once reactivated, you can use it to issue the return permit for your son, Keep yr credit card handy to pay 500 and thats it. You can email or print and send to your son.", "username": "aak", "commentId": "comment-7399456"}], "question": "MY SON IS IN INDIA MORE THAN 6 MONTH NOW. BEFORE HE WILL ENTER I HAVE TO PAY QR 500. I HAVE DOWN LOADED METRASH2 IN MY MOBILE. GUIDE ME WHICH SERVIES TO SELECT", "username": "c.cordiero@yahoo.co.in"}
{"comments": [{"comment": "Qatar is not a good place for graduates or those with no work experience .. It is better for him to get a couple of years experience under his belt in his home country and then try here ..", "username": "britexpat", "commentId": "comment-7399711"}, {"comment": "We welcome him with open arms - joys", "username": "muad-db", "commentId": "comment-7399706"}], "question": "Would Qatar be a good place for a recent Math and Business grad form the US to move to with the purpose of startign a career?", "username": "whirlingmerc"}
{"comments": [{"comment": "I agree with all the comments here. Owner knowing it while you are trying to hide it is worse than just being honest and telling him what happened. If you are willing to pay, then there should be no point of hiding it. Accidents do happen and could have happened any other way as well no matter how careful you are. Better to tell the owner on what happened, admit your mistake and tell him that you will be extra careful in future and willing to pay.", "username": "umkhan", "commentId": "comment-7400571"}, {"comment": "No matter how good the workmanship is at the garage there always remain telltale signs from which one can get to know the car had met an accident. Suggest, you inform the car owner about the incident. It will help improve your image, and surely he is not going to kill you.", "username": "acchabaccha", "commentId": "comment-7399966"}, {"comment": "well ... if the owner has metrash2 service he will recieve a message saying that the car got a traffic violation ticket and if he/she checked the ticket then you are cought ! lol good luck", "username": "mohammedshamya", "commentId": "comment-7399931"}, {"comment": "If you're going to shoulder all the expenses for the repair, why hide it from the car owner? Anyway, even if you attempt to conceal the accident, there is a good and very high chance the owner would still know about it. Better be the first person to inform him, I'm sure he can understand. All drivers have made mistakes once in their driving life....", "username": "txtmeyt", "commentId": "comment-7399926"}, {"comment": "It is better to be honest ... What if the owner notices the repair or finds out about it when he/she goes to sell the car ?", "username": "britexpat", "commentId": "comment-7399921"}], "question": "Hi, Yesterday night inside Mathaar steert, i have reversed my car and made accident with a lexus that was parked behind my car, its damaged my car and the number plat in his Lexus ,  its my first accident which mistakes is mine since I am holding my license one year, I am really sad about this as I always used to drive carefully,  that happened because I put the reverse gear before i check the glass and instead of giving break i gave the legs to accelrator after checking the mirror, which is really a great mistake and i was full of tension that time.. I went to police with him and cleared everything and get the paper for me and him, but what i am worried is i donot want my car owner know that I did this mistake, even though i will fix it with legal procedure.. , will there be any notification sent to owner of the car or only the driver who was driving at that time", "username": "akramwahid"}
{"comments": [{"comment": "Brit, Thanks for your valuable advice.", "username": "acerd", "commentId": "comment-7400061"}, {"comment": "http://www.qatarliving.com/forum/advice-help/posts/medical-assistance-consultation#comment-7399991", "username": "Charles73", "commentId": "comment-7399996"}, {"comment": "Really..", "username": "Charles73", "commentId": "comment-7399991"}, {"comment": "Yes you can .. the cost is nominal - 30QR I believe for consultaion", "username": "britexpat", "commentId": "comment-7399951"}], "question": "Dear QL members, My Family is on Family Visit visa, is it possible to approach any Govt. health centers for medical assistance in case of any ailment, being on Visit Visa. Please advise", "username": "acerd"}
{"comments": [{"comment": "Apollo is the best my pal ...... wish you happy journey ....... Come back in time .........", "username": "Molten Metal", "commentId": "comment-7401116"}, {"comment": "Go to the one in Wakrah behind the bakery", "username": "muad-db", "commentId": "comment-7400931"}, {"comment": "Try Naseem Al Rabeeh Medical Centre at C Ring road near Gulf Cinema telephone # 4465 2121, 4465 5151.", "username": "acchabaccha", "commentId": "comment-7400661"}], "question": "Good Morning All, I am trying apply visa in Bahrain and they need a fitness certificate to proceed the visa application. Please advise which is the cheapest clinic / hospital i can get one.   Thanks        ", "username": "Ajish C Baby"}
{"comments": [{"comment": "Zab, Enter any money exchange agency you see ...... just enter without any hesitation .................", "username": "Molten Metal", "commentId": "comment-7401071"}], "question": "", "username": "zabaga"}
{"comments": [{"comment": "Agree with Brite here, you have been posting it over and over again here, and that is the reason why QL keeps deleting your post. Instead of asking, why not explore. Take some of your own time, talk to HR representatives of the companies, and above all, find out which are the companies that exist in Qatar.", "username": "ani_chy", "commentId": "comment-7392441"}, {"comment": "Why do you keep repeating the same post .. Qatar and the GCC is not renowned for offering jobs to expat 'freshers' Companies here bring in expat labour with experience It is better to stay in your country and get a few years experience first", "username": "britexpat", "commentId": "comment-7392226"}], "question": "i done electrical and electronics engineering last year november.  came to qatar recently having no experience, how to get job as a fresher? which company takes freshers?  my visa going to expire on next month.please let me know", "username": "Jayakumargosangi"}
{"comments": [{"comment": "Dear Sir, Please find in below mention list of Indian school's don't get disappointed you will find in anyone of below. Doha Modern Indian School Al-Khor International School – Indian Stream Birla Public School DPS Modern Indian School Ideal Indian School MES Indian School The Scholar International School Shantiniketen Indian School Rajagiri Public school Pearl School Olive International School Noble International School Loyola International school Bhavan's Public School Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7392296"}, {"comment": "Go to the schools.. Speak nicely to the head master and you will have joys", "username": "muad-db", "commentId": "comment-7392266"}, {"comment": "This is an issue faced by many who come to Qatar .. School places are at a premium http://www.sec.gov.qa/En/Pages/Home.aspx", "username": "britexpat", "commentId": "comment-7392261"}, {"comment": "Can they help?where is their office?Because joining in the middle is really making my life tough", "username": "lnagumantri", "commentId": "comment-7392236"}, {"comment": "Go and contact supreme education council and ask for their help", "username": "britexpat", "commentId": "comment-7392231"}], "question": "Recently moved to doha and last week i got my daughter's RP.Tried all indian schools for admission in KG! for my daughter. Can anybody help", "username": "lnagumantri"}
{"comments": [{"comment": "You are very welcome @Molten Metal..", "username": "shahadat.hossain", "commentId": "comment-7393066"}, {"comment": "MSH, Thanks a lot my pal ...... you make life easier for others ......... so nice of you ..................", "username": "Molten Metal", "commentId": "comment-7392751"}], "question": "In my last post I showed you how you can enable or disable automatic spell checking in Firefox. In today’s post I am going to show you how you can enable or disable automatic spell checking in another popular browser Google Chrome. To enable/disable automatic spell checking in Chrome just click on the 3 vertical dots   situated upper right hand side of the browser. Then go to... Settings > Show advanced settings… > Languages > Language and input settings. From Language window either check or uncheck “Enable spell checking” check box. And yeah that’s all. See the screenshots below for better understanding...       Mohammad Shahadat Hossain IT Engineer Email: Phone: 77296272", "username": "shahadat.hossain"}
{"comments": [{"comment": "thanks for your valuable comments i would prefer to go barwa village as its near also from wakrah", "username": "Starh", "commentId": "comment-7395266"}, {"comment": "Atlas medical centre barwa village is another good option.", "username": "civil33", "commentId": "comment-7393856"}, {"comment": "You could go to Naseem Al Rabeeah Medical Center on C Ring Road close to Gulf Cinema.", "username": "acchabaccha", "commentId": "comment-7393126"}, {"comment": "So confusing .. Both have best treatment :0(", "username": "britexpat", "commentId": "comment-7393006"}, {"comment": "Dear Sir, Doha Clinic ....best treatment Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7392811"}, {"comment": "Star, Go to Apollo Clinic ........... best treatment ........", "username": "Molten Metal", "commentId": "comment-7392716"}], "question": "Hello, Dear Friends,  I would like to know which is the good Eye clinic should i go for doing a checkup kindly pls. provide your valuable information.   Thanks & Regards.", "username": "Starh"}
{"comments": [{"comment": "@techn I am taking note on this issue. Please keep your eyes on my future posts. I will show how to embed videos on your webpages linking from CDNs.", "username": "shahadat.hossain", "commentId": "comment-7392196"}, {"comment": "can you show how to stop embedded video in the webpage not to play automatically for IE and Firefox", "username": "techn", "commentId": "comment-7392166"}, {"comment": "We are doing fine ,,,.................... ....", "username": "Molten Metal", "commentId": "comment-7391776"}], "question": "Good morning fellas. Take a morning appetizer. If you are using Firefox then there might be any situation when you want to shut down automatic spell checking by Firefox. I often do it especially when I write Bangla (which is my mother tongue) using English letters. I am too lazy to switch between keyboard layouts!!!  However if you wanted to know how disable/enable Firefox automatic spell checking then here is a quick hack…  Firefox Step 1 - In Firefox just go to menu or click on   > Options > Advanced Step 2 – From Browsing section check/uncheck “Check my spelling as I type” Step 3 – Close options window. That’s all you need to do.   In very next post I am going to show you how you can enable/disable automatic spell checking in Google Chrome browser. Till then take care and enjoy yourself… Mohammad Shahadat Hossain IT Engineer Email: Phone: 77296272", "username": "shahadat.hossain"}
{"comments": [{"comment": "What you are looking for is PABX system for your office. I can help you on this. Feel free to message me", "username": "mla.baais", "commentId": "comment-7400636"}, {"comment": "The one & only ........ .........", "username": "Molten Metal", "commentId": "comment-7392746"}, {"comment": "There is a company named Ooredoo which provides such services", "username": "britexpat", "commentId": "comment-7392666"}], "question": "Can anyone please tell me, which companies I should contact make a local call network, where our staffs can forward calls among, and allocate extension for staffs, voice dialing incase now answer etc..", "username": "akramwahid"}
{"comments": [{"comment": "try with firelinkqatar, for their contact number search in google", "username": "techn", "commentId": "comment-7393202"}], "question": "Hi, Can anyone tell me where can i buy Fireray5000 Beam Detectors??", "username": "hey05321"}
{"comments": [{"comment": "And reading from QL posts, there are many who abuse the workers , mistreat them and don't pay their wages on time", "username": "britexpat", "commentId": "comment-7392586"}, {"comment": "Wuna, What happened my pal, please open your heart here, tell us your story ........... ? . Please don't generalize , there are kind guys who take you under their wings from the day you landed here .......... and allow you to pick the rewards for your heart's fill ................", "username": "Molten Metal", "commentId": "comment-7392446"}, {"comment": "The sponsor is the number 1 thief in Qatar.", "username": "Wunae", "commentId": "comment-7392386"}, {"comment": "All hail the sponsor .. For he must be obeyed", "username": "britexpat", "commentId": "comment-7392131"}, {"comment": "Trust your sponsor even if he shafts you :0( The only issue you have is that your visa is tied up and cannot come back to another company", "username": "britexpat", "commentId": "comment-7392101"}, {"comment": "Trust your sponsor even if he shafts you :0( The only issue you have is that your visa is tied up and cannot come back to another company", "username": "britexpat", "commentId": "comment-7392096"}, {"comment": "@molten: we trust him since from the beginning, but we needed to be sure because lately he is not being professional anymore, we talked to him formally but ended up hearing bad rumors about us. he's terminating people without any valid reasons and doesn't give them what they deserve to get.", "username": "orangevanilla", "commentId": "comment-7392086"}, {"comment": "yes, they will give us the gratuity because they dont want us to complain to the labour department.", "username": "orangevanilla", "commentId": "comment-7392056"}, {"comment": "We must trust our sponsor ........ that's the first step for getting high rewards ................", "username": "Molten Metal", "commentId": "comment-7392051"}, {"comment": "Is the company paying your benefits before sending you out ?", "username": "britexpat", "commentId": "comment-7392021"}], "question": "Hi, I am sorry, i know that i should've talked to the labour department directly about this, but just in case some of you have some knowledge about my concern, please advice.   my company is sending me home this week with only one way ticket but didnt cancel us, they said that it will serve as a long vacation, but we already know the tricks that always happens in our company, they promise us that they will bring us back within 2 months but we dont trust their words, but my concern is,  maybe, just maybe they will cancel us while we are on our way to our hometown, can they do that? oh and my contract will end on january and they renewed our ID's.", "username": "orangevanilla"}
{"comments": [{"comment": "Dear Sir, Try for Brazil embassy in Qatar. Embassy of Brazil in Doha Address: Wadi Al-Hadab Street 980 Building 20 - Al-Dafna Doha, Qatar (Map) P.O. Box: 23122 Phones: (+974) 4483-8227 (+974) 4483-8812 Consular: Extensions 232/234/230 Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7394241"}, {"comment": "yah I'm going alone", "username": "Abdullah.Rahman", "commentId": "comment-7394041"}, {"comment": "Are you going alone my pal ? Just remember that you have to pay taxes and there is no sponsor to look after you", "username": "muad-db", "commentId": "comment-7393966"}], "question": "", "username": "Abdullah.Rahman"}
{"comments": [{"comment": "Visit G.E.T. (Generic Engineering Technology) for a \"Walk In Interview\" any morning. They are hiring and located in Al Muftah Centre Building opposite Rumaila Hospital. In the same building, you can find, Al Nakheel Landscaping also. Pick up the phone and speak with the HR department of Medgulf Construction Co.", "username": "Equin0x", "commentId": "comment-7395376"}, {"comment": "I have never paid on bayt or Gulftalent.. get out there and start browsing. Use gulftalent , Reed, Bayt, naukrigulf and QL Classifieds", "username": "britexpat", "commentId": "comment-7394861"}], "question": "Hi Friends, Can you guys share some resources from where i can get the list of companies that are hiring specially for civil engineering positions? It will be really helpful for me so that i can target those comapnies where positons are acutally vacant. Currently i am following gulf times classifieds and QL job portal but these are not just enough. Other sites like bayt and noukrigulf require paid subscriptions which is not good as well.  Kindly share your expereices and useful resources. Regards Ahmad", "username": "civil33"}
{"comments": [{"comment": "Then... you have permanent residence... Enjoy the weather if you get the visa... buy cloths there.. Primark will take care your budget.", "username": "Zam Zam", "commentId": "comment-7393826"}, {"comment": "Yes I have Qatar ID..", "username": "Rash377", "commentId": "comment-7393636"}, {"comment": "You need to understand basic English language going into the UK. As you have mentioned, your motive is Tourism, definitely that doesn't translate permanent residence.", "username": "dohaplanner", "commentId": "comment-7393501"}, {"comment": "Lol @ muad-db.", "username": "Britonie", "commentId": "comment-7393376"}, {"comment": "Why go where it always rains and even an apple is expensive my pal", "username": "muad-db", "commentId": "comment-7393227"}, {"comment": "So what do you have? A Qatar ID? Then you have a permanent residence visa.", "username": "Wild Turkey", "commentId": "comment-7393091"}, {"comment": "Surely only you can tell which type of visa you are on ... Are you a permanent resident or visitor ?", "username": "britexpat", "commentId": "comment-7393046"}], "question": "I am applying for  UK tourist visa. They have asked what kind of visa do you have, options are temporary visa or permanent resident visa. Anyone can help with this.", "username": "Rash377"}
{"question": "   ", "username": "veekeycee"}
{"question": "", "username": "imran132"}
{"comments": [{"comment": "On Salwa Road just by Quality Hypermarket you will find a variety of tinting shops including: Titanium, Vcool, YellowHat, Protection and Alnadhi. I can speak for Titanium personally, they were great, fast and very professional films. Offer a 5 year guarantee encase any bubbles or pealing occurs (I believe that's a common guarantee amongst the different shops). Price will depend on the type of tinting you wish to have and the number of windows. Titanium go up to 90% head exclusion but it's pretty expensive.", "username": "theresalwaysmore", "commentId": "comment-7394441"}, {"comment": "Enjoy your new car my pal .. Joys", "username": "muad-db", "commentId": "comment-7394226"}, {"comment": "Dear Sir, Exodus Window Film WLL sun control film Address: PO Box 8430, No.408, 4th Floor, Deera Commercial Building,, Near Karwa Bus Stand, Doha, Qatar Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7394196"}, {"comment": "Go to Nanofilm or Titanium See google for their locations", "username": "britexpat", "commentId": "comment-7394171"}], "question": "Any expert advise available on the best available Sun control films (tinting)? Contact details? Need to get it done for my new Nissan PATROL.", "username": "macroman"}
{"comments": [{"comment": "I guess Qatar Airways have a services called Maha service where they provide assistant for aged people etc. check it out", "username": "Rizks", "commentId": "comment-7394311"}, {"comment": "Wish mom a safe journey . She will love the fresh air here", "username": "muad-db", "commentId": "comment-7393991"}, {"comment": "you can hire a person from the airlines and they will look after your mother in law. this is proffesional", "username": "unicorn190", "commentId": "comment-7393881"}], "question": "Hi friends, Is there any one coming from hyderabad after 12th October 2016 My motherinlaw has to come she need some one as she cant come alone please text if any one is coming", "username": "pras123"}
{"question": "Dear All, I have applied for PCC here at Indian Embassy -Doha Qatar. Hense I just want to know is there any enquiry will there at my home country for issuing the PCC.  ", "username": "MAXBOB"}
{"comments": [{"comment": "When a target achieved, the owner is happy and you get a feeling of satisfaction .............. ..........", "username": "Molten Metal", "commentId": "comment-7392591"}, {"comment": "Dear Sir, If your Qatar ID is lost: 1) Go to Capital Police Station in Crazy signal. Fill out lost ID form, Pay 10 QAR with either credit card or e-cash (no cash accepted). They will give you a report in 5 mins. 2) Go to any govt. typing center and get ID lost application typed. 3) Bring this application to your company, you need company stamp on the application and sponsor's signature (sometimes, immigration can give your ID without sponsor's signature too. But stamp is necessary) 5) Bring the Police report you got in 1st step, application form to immigration department. 6) Enter the door, number 1 and inside go directly to counter 2. No need to get number for queue. Sometimes they ask company PRO (Mandoop) 7) Pay 200 QR with Credit card or e-cash. Your ID will be ready in 10 mins. If your bank card is lost call 24 customer service center and block the card. Visit the bank branch and apply for new card, ussally they charge Qr. 50 and will take weeks time to issue. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7391766"}, {"comment": "miwat: Yes, you can get another one and you don't need to worry on this. Report the matter to your company's HR and the mandoob (PRO) knows the steps of getting you a new one. Meanwhile, keep a photocopy of the ID with you at all times in case the authorities carry out a checking. Please overlook the above comment. Some people write for the sake of writing giving false hopes to people in difficulties and get some sort of an enjoyment in doing so.", "username": "acchabaccha", "commentId": "comment-7391726"}, {"comment": "miwat my pal ... Where did you lose it .. We will come a help you find it", "username": "muad-db", "commentId": "comment-7391656"}], "question": "hi all, my qatar id is about to expire but somehow i had lost it. i just want to know that is it possible me to renew it and get new id without old one? please help", "username": "miwat"}
{"comments": [{"comment": "Friday is a good day .. So many visiting the mall with happy faces", "username": "muad-db", "commentId": "comment-7395021"}, {"comment": "Do a soft launch on wednesday.. this will help you identify issues, ready for the weekend rush", "username": "britexpat", "commentId": "comment-7394726"}, {"comment": "Nothing is perfect, not even the universe. You are asking for the impossible.", "username": "Wild Turkey", "commentId": "comment-7394721"}], "question": "Hi everyone, I just want to get your opinions on what day is perfect to open a small shop inside a mall. Choices are Thursday night or Friday night? We feel that both have good footfall among malls. Which do you think and why? Thanks in advance. :) ", "username": "sparklytrends18"}
{"comments": [{"comment": "Go to The Khalifa International Tennis and Squash Complex in Westbay", "username": "britexpat", "commentId": "comment-7396156"}], "question": "Hi.  Im looking for a personal tennis trainer in westbay area. Any advise?! ", "username": "Omardem"}
{"comments": [{"comment": "@Ali. really appreciate your candid advise all along. i have enrolled with simplilearn and the training has commenced 7 oct. as of now am satisfy with their service. thanks", "username": "fataiilemoboye", "commentId": "comment-7406061"}, {"comment": "Dear Fataiil, Greetings from Madras Management Training Institute, MMTI, the leading institute providing PMP with 4 batches every month. 2 regular batches(Sat,Mon,Wed) & (Sun-Tues-Thurs) Timings - 7pm to 10pm 2 weekend batches Fridays-Morning , Fridays-Afternoon. For detailed information about the course, drop me text. Jeeno 30738773 jeeno@mmt-institute.com mmtijeeno@gmail.com", "username": "Jeeno MMTI", "commentId": "comment-7402806"}, {"comment": "@fataiilemoboye It worked for me. Not only for PMP but RMP too.", "username": "Ali.pk", "commentId": "comment-7397046"}, {"comment": "@Ali.thanks so much for your kind advise. i shall look into that........but are you sure this online classes can beat classroom? thanks", "username": "fataiilemoboye", "commentId": "comment-7396856"}, {"comment": "Hi There! There are some institutions in Doha Like enertech qatar www.enertechqatar.com But i will recommend online self learning from http://www.simplilearn.com/ I took my training from this website. and pass my PMP exam in first attempt in November 2015. Quality of delivering a lecture on this website is much better than locally available instructors in Doha. And of course online course are cheaper and it also includes online mock exams.", "username": "Ali.pk", "commentId": "comment-7396281"}], "question": "hi guys, dose any one know any reputable PMP training center where i can register for PMI certification class in qatar? your response is highly appreciated. thanks", "username": "fataiilemoboye"}
{"comments": [{"comment": "Dear Ginesh, A premier (logistic / Packers & Movers) company with 15 years experience in State of Qatar & UAE. A professionals and experienced Crew. A wide range of innovative services in the moving industry sector. A wide range of transportation of Box Trucks. A professionals and experienced management, Sales & Operation team. These include but not limited to: *Local and International Move,Office, Villa, Apartment Relocation services *Inbound / Outbound air and sea freight. *Packing and Unpacking services. *Assembling and Disassembling of Furnitures. *Special cargo handling. *Customs clearance and documentation *Freight forwarding – General and Project cargo *Warehouse Storage *Export and Import of car ,", "username": "ccir", "commentId": "comment-7392216"}, {"comment": "The car will however have lower resale value", "username": "britexpat", "commentId": "comment-7389636"}, {"comment": "The standards are pretty much similar .. The only issue may be tyres .. Usually , the radiator and cooling systems will be sufficient", "username": "britexpat", "commentId": "comment-7389631"}, {"comment": "@britexpat..thks for your message..but my question here is the car is with american standards..not GCC specs..so will it have any issue?..any idea?", "username": "Ginesh Haridas", "commentId": "comment-7389621"}, {"comment": "Gin, Leave that idea atonce. You will suffer alot. Better do PhD than just getting the scrap from one place to the other ........................", "username": "Molten Metal", "commentId": "comment-7389461"}, {"comment": "Better to buy one from here my pal ..", "username": "muad-db", "commentId": "comment-7389371"}, {"comment": "Most countries refer to Kelly's Blue Book to evaluate the current value of the car for import tax. The original bill which maybe five years old doesn't make sense!", "username": "Wild Turkey", "commentId": "comment-7389321"}, {"comment": "The original receipt/invoice stating the value of the car is necessary as the custom’s charge is 5% of the car’s value. Any car that is being imported into Qatar has to be less than 5 years old, it must be left-hand drive and it must meet gulf standards . Once in Qatar the car must be registered with the Traffic Department of the Ministry of Interior within 15 days and the registration renewed annually. You will need to bring proof of purchase, your ID, the filled out registration form (in Arabic), your insurance document, and pay the fee.", "username": "britexpat", "commentId": "comment-7389161"}], "question": "Hello...does anyone know of there is any issue to import cars with north America specifications from Dubai to Qatar?? The vehicle has had an accident in the US(no chasis damage) and passed the Dubai govt (RTA)fitness test..has any new rule taken effect banning such accident vehicle from US via Dubai?? Any idea any one??..pls send in your thoughts Thanks Ginesh", "username": "Ginesh Haridas"}
{"question": "Hi can some one send me the contact no of a Hijama  / Cupping clinic in Al wakra please. ", "username": "hhaq61"}
{"comments": [{"comment": "@ anees rafa. you are really funny guy.", "username": "Prize", "commentId": "comment-7389551"}, {"comment": "In my village we burn dry leaves or wood just below the hive, smoke makes bees leave the hive permanently. Or else pour hot water on it. Of course the best way is to contact Baladiya dept.", "username": "Mufti Shahid", "commentId": "comment-7389531"}, {"comment": "If you can wait until the bees leave I will take the combs. In my experience the bees here are not aggressive and leave people alone.", "username": "Mary Catherine", "commentId": "comment-7389521"}, {"comment": "Call Baladiya or check QL for pest control companies and get their service", "username": "britexpat", "commentId": "comment-7389496"}, {"comment": "You need the skill to get the free honey , if you are lucky.", "username": "Britonie", "commentId": "comment-7389486"}], "question": "i have 2 hives in my home. is there any service that could help to remove it", "username": "vinays"}
{"comments": [{"comment": "How will Alostoora Travel help him get round the house contract issue ?", "username": "britexpat", "commentId": "comment-7391581"}, {"comment": "for ur visa assistance you may feel free to cAL ME FOR SOME DETAILS AND INFO ABOUT APPLYING FAMILY VISA.MY MOBILE # IS 66957271.THANK U", "username": "Alostoora Travel and Tourism", "commentId": "comment-7391526"}, {"comment": "House rent contact on your name with baladiya is must for family resident visa. Good luck :)", "username": "Amaan.Ind", "commentId": "comment-7389596"}, {"comment": "Look out for Sheen Services on these forums, maybe they can advise you better.", "username": "Angelo", "commentId": "comment-7389586"}, {"comment": "There are no other options .. You could try submitting your papers without this and see if they are accepted", "username": "britexpat", "commentId": "comment-7389576"}], "question": "Dear All, Iam going to apply for my wife resident visa.Is it necessary that the house contract should be in my name ? If not what are all the other options please assist me", "username": "santhoshcbe77@gmail.com"}
{"comments": [{"comment": "you cannot as far as i know it should be your own specially if residence visa", "username": "Mohanadf", "commentId": "comment-7391686"}, {"comment": "Hi Britexpat Can i use my fathers contract ?", "username": "jameskarak", "commentId": "comment-7389661"}, {"comment": "If an agent 'helps' then you are both acting illegally", "username": "britexpat", "commentId": "comment-7389646"}], "question": "Dear all Please advise if i can use my fathers house contract to sponsor my wife for residence visa.", "username": "jameskarak"}
{"comments": [{"comment": "WT, Be hopeful my pal ............ everyday is not the same ...............", "username": "Molten Metal", "commentId": "comment-7391166"}, {"comment": "There is a simple solution .. The authorities reading these posts can contact the OP and then tKd action against the managers .. This will help enhance the reputation", "username": "britexpat", "commentId": "comment-7389896"}, {"comment": "It's a sad fact that many companies in Qatar think their employees are slaves. Qatar's world wide reputation has suffered already from that fact and there is no hope that this will change in the future.", "username": "Wild Turkey", "commentId": "comment-7389886"}, {"comment": "thank you sir", "username": "help_me", "commentId": "comment-7389681"}, {"comment": "The simple answer is No! But then companies get away with much worse here .. Tell him to go to the human rights commission", "username": "britexpat", "commentId": "comment-7389656"}], "question": "My friend has resigned from his job with one month notice period as per his contract. He is a Marketing Engineer. Can the company hold him and not release him after 1 month notice period till all customer pending payments are collected. Will he has to be with the company till all payments are collected. Can some one please advise.", "username": "help_me"}
{"comments": [{"comment": "Jarir Bookstore", "username": "stealth", "commentId": "comment-7390266"}], "question": "Hello everybody, I am looking for an official microsoft software seller. if anyone know   some contacts please let me know. Thanks in advance.", "username": "dhakertn"}
{"comments": [{"comment": "online visa cost is 237 QR YOU SHOULD HAVE 3 MONTH IN your residency in Qatar minimum in the day of arrival and 6 month passport validity for any further assistant let me know", "username": "Mohanadf", "commentId": "comment-7391911"}, {"comment": "hello sir feel free to contact me for some details for tourist visa in dubai. we can provide and assist. 669657271", "username": "Alostoora Travel and Tourism", "commentId": "comment-7391521"}], "question": "I need little help if someone traveled to dxb on this eid please tell me how much dxb entry visa cost online for gcc residents. And if it is necessary to have RP 6 month old", "username": "sholee74"}
{"comments": [{"comment": "You will find it difficult to survive in that money as cost of accommodation will take away a major part of your salary. You will then be left with a very small sum to meet your essential expenses here and there would be no savings. As such, I suggest you come back and take your issue to the Human Rights Committee and see what they have to say.", "username": "acchabaccha", "commentId": "comment-7390141"}, {"comment": "but if i come back he is offering only QAR 1500 as my salary without accomodation...", "username": "renney", "commentId": "comment-7390116"}, {"comment": "As the law stands , no.. But the new labour law should allow for it .. As an aside .. If you don't come back , your sponsor may report you as an absconder .. So think things through .. How well do you get on with them", "username": "britexpat", "commentId": "comment-7390096"}, {"comment": "thank you soo much friend...", "username": "renney", "commentId": "comment-7390081"}, {"comment": "Changing job is a huge task, bigger than moving a mountain my pal ...... ..... you will get tired & fed up ......... your health may be affected as well ........", "username": "Molten Metal", "commentId": "comment-7390046"}, {"comment": "Ren, Better to forget what happened here ........ look for good job in Dubai or Muscat ............. It will be a headache for you if you try to resolve it completely ........ you do not need that much sincerity ............ think for your future somewhere else ............ your sponsor & you will be at peace ...............", "username": "Molten Metal", "commentId": "comment-7390041"}, {"comment": "if he terminates me, can i join in some other company in qatar?", "username": "renney", "commentId": "comment-7389996"}, {"comment": "Your sponsor CANNOT change the contract mid stream .. Your best option is to come back .. Tell the sponsor that you are unwilling to take the new offer and ask him to terminate you .. Request an NOC If there is an issue , then contact the human rights commission", "username": "britexpat", "commentId": "comment-7389916"}], "question": "im working in qatar as a video editor  from March 2015..i was provided company accomodation and QAR 2300 as salary. June 27th 2016 i came to india for vacation.. my sponsor asked to come back to qatar by september month., Now my sponsor is telling that he cant pay the same salary which i was getting before.. he is ready to pay me only QAR 1500 as my salary and without company accomodaion.. i am not willing to go backfor this salary package and my Qatar ID card expires on March 07 2017..my questions are  *what is the next procedure i should do to change to another company?  * if my visa is not cancelled, after how days or years i can come back to qatar and join in  new company? * what to do if my sponsor refuses to cancel my visa? * will this be a problem for me to get job opportunities in other gulf countries? * should i be there in qatar to cancel the visa? please guide me what i should do further", "username": "renney"}
{"comments": [{"comment": "Not very pretty. Pretty tacky interior .. However seats seven easily , sliding doors and comfortable", "username": "britexpat", "commentId": "comment-7390186"}, {"comment": "A decision- that, you would regret later, for sure.", "username": "Equin0x", "commentId": "comment-7390156"}, {"comment": "Why do you want to purchase it in seconds ? Why not wait a little", "username": "britexpat", "commentId": "comment-7390111"}, {"comment": "First of all the model is pretty old and the vehicle will demand regular maintenance. Secondly, after a couple of years you may find it difficult to sell this car.", "username": "acchabaccha", "commentId": "comment-7390101"}], "question": "Assalam Aliakum... Kindly let me know your views (adventages & disadvantages) on this Vehicle - KIA(Carnival) 2006 model, As I have an idea of purchasing this vehicle in Seconds in Qatar.  Your views are most valuable... Jazak Allah Khair.... Thanks..", "username": "imranbashag"}
{"comments": [{"comment": "All banks are mostly the same here. However I would avoid HSBC as it has the fewest number of branches out of all the banks and it also does not offer after hours banking whereas all the other major banks have branches that are open in shopping malls until late at night. I would also suggest you pick the bank that your company uses so that your salary transfers will be faster.", "username": "Wunae", "commentId": "comment-7391691"}, {"comment": "WT is wrong, We are seeing a different pic. at HSBC ............ ........", "username": "Molten Metal", "commentId": "comment-7391311"}, {"comment": "All banks want only one thing: YOUR money.", "username": "Wild Turkey", "commentId": "comment-7390806"}, {"comment": "All the banks are equally bad/good in service. I don't find any difference.", "username": "Mufti Shahid", "commentId": "comment-7390776"}, {"comment": "Go for the HSBC or QNB .......... You will get respect & peace of mind ......", "username": "Molten Metal", "commentId": "comment-7390661"}, {"comment": "Where will you live", "username": "muad-db", "commentId": "comment-7390536"}, {"comment": "All banks are pretty much the same here .. If you're Indian , then Doha Bank has strong ties to the country", "username": "britexpat", "commentId": "comment-7390476"}, {"comment": "There are some people my pal who write just for the sake of writing. They always jump to be the first and many times the only person to post something at QL.", "username": "acchabaccha", "commentId": "comment-7390401"}, {"comment": "Dear Sir, DOHA BANK is the best with state of the art internet banking, fund transfer to home country, Easy to get loans and good schemes with great credit card facilities, good public relations , efficient staff , easy widrawals easy pay in services and ATMs at the best possible locations. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7390376"}, {"comment": "In Qatar most banks offer very good service to their customers. There appears to be a stiff competition among them. As such it will hardly make much of difference to you which bank you choose to maintain an account. Usually, the preference is for the bank where the company has an account as it facilitates quick transfer of salaries. As for ease of sending money home, people here usually to use the services of money exchange companies and there are several of them here. They can have the money deposited in to your bank account in your country or your people back home can collect it in cash. The option is yours. These exchange companies are preferred over banks because of their convenient timings, better rates, lower service charges, quicker service and also because they operate all days of the week.", "username": "acchabaccha", "commentId": "comment-7390371"}, {"comment": "Welcome my pal .. We are happy that you are here", "username": "muad-db", "commentId": "comment-7390366"}], "question": "Hello I will move to Doha next month iA. Can you please advice on the best consumer bank? My concerns are: 1. Ease of sending money to home 2. Good ATM and online banking facilities 3. Annual charges on account, card 4. Minimum balance requirements 5. Customer service 6. Credit/ debit card rewards Thanks in advance. Note to moderators: The relevant existing posts are couple of years old, and do not address my requirements.", "username": "elmariachi"}
{"comments": [{"comment": "hi am readio technician i will do that work don't worry", "username": "satheesssssss", "commentId": "comment-7419676"}, {"comment": "thanks for all for the advise and help. there was a small mechanical issue. i was bale to fix it a shop called Halool at the end of the salwa road and opp of the safari hypermarket.", "username": "vxfernandes", "commentId": "comment-7392291"}, {"comment": "It needs cleaning only , just put it under some air pressurized air for 3 seconds ............ electronic dust is cause of the problem .................", "username": "Molten Metal", "commentId": "comment-7391161"}, {"comment": "Thanks for the reply. Wires are OK. There was a issue with playing cd,s it was not ejecting properly. I was able to remove the cd but now it won't take in any cd anymore. It comes out once I insert it.", "username": "vxfernandes", "commentId": "comment-7390626"}, {"comment": "Fernandez my pal... No \"electrician\" can do this job. You will find many shops in the industrial area who fix such problems. Just take a trip and look around. Check with spare parts shops there and the", "username": "acchabaccha", "commentId": "comment-7390571"}, {"comment": "Fernandez my pal .. Go to any electrician .. He will fix for 10 riyals .. Is the wire connected properly", "username": "muad-db", "commentId": "comment-7390286"}], "question": "Dear All, My car cd player is nit working. Can you suggest me electronic reapir shop. I could not find the a shop called Basheer Radio. I heard it was moved to najma but could not find it there too.   Please advise.   Regards ", "username": "vxfernandes"}
{"comments": [{"comment": "What has this to do with the topic", "username": "britexpat", "commentId": "comment-7392146"}, {"comment": "Many ex judges, generals, brigadiers , surgeons and their wives { who are somebody's moms } are rotting in the old age homes ......... around the world ...........", "username": "Molten Metal", "commentId": "comment-7392061"}, {"comment": "Some people have nothing inside them --- no feelings, no emotions, no sympathy, no thoughts........ All they have are \"philosophical\" unwanted \"advice\" they are are ever ready to give to others whether they make sense or not. They must write for the sake of writing.", "username": "acchabaccha", "commentId": "comment-7391231"}, {"comment": "There are millions of dear moms & pops are just waiting to die where as their sons & daughters in law are on a prolonged world tour ............ even at this moment of time ........", "username": "Molten Metal", "commentId": "comment-7391181"}, {"comment": "Yet, while a person who is in a difficult situation posts a query at QL seeking advice on how go home quickly to attend the funeral of one's mom, there are other people at QL who come come down shamelessly \"advising\" to keep the lady's body in a morgue. Not only that, the \"adviser\" also states a time period of \"one week\" for the lady to be kept in the morgue. There are some people in this world who live with a dead conscience, dead human feelings, dead thoughts and who must write just for the sake of writing.", "username": "acchabaccha", "commentId": "comment-7390901"}, {"comment": "Having been an expat for a very long time , I have yet to meet someone who would willingly forego attending their parents' funeral", "username": "britexpat", "commentId": "comment-7390866"}, {"comment": "Some people at QL understand other people's feelings better than the person who is suffering. Their \"philosophical advice\" seem to have no end.", "username": "acchabaccha", "commentId": "comment-7390851"}, {"comment": "Let his other close relative perform the ceremony in his place. Being absent in such situations is common with expats ............... We can be present at two places simultaneously .............", "username": "Molten Metal", "commentId": "comment-7390651"}, {"comment": "Mom's body can be kept in a morgue for one week for example ........ Do not make hurry , let that guy remain calm & composed till the time he gets his PP back .......", "username": "Molten Metal", "commentId": "comment-7390646"}, {"comment": "I don't think it would be possible before tomorrow. The \"Mandoob\" is the company's PRO who takes care of such government-related jobs. Ask your friend to talk to him.", "username": "acchabaccha", "commentId": "comment-7390561"}, {"comment": "he is ready to cancel, but how can he get by today only??", "username": "Shikeb Mehdi", "commentId": "comment-7390526"}, {"comment": "Dear Sir, If he canceled the visa, he can able to get the passport immediately otherwise he should wait until get the Qatar ID. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7390516"}, {"comment": "What is mandoob?", "username": "Shikeb Mehdi", "commentId": "comment-7390496"}, {"comment": "May his mother rest in peace. He cannot travel without a passport.. Tell him to contact his company HR and seek help for an emergency", "username": "britexpat", "commentId": "comment-7390466"}, {"comment": "I guess the only people who could help him out in this situation is his company's HR and Mandoob. Pleas wait for comments from other QLers on this matter.", "username": "acchabaccha", "commentId": "comment-7390446"}], "question": "Dear all, I need advise, my friend's mom is no more, let her soul rest in peace. he wants to go back to india for the last rituals of his mother but his passport has been submitted to moi for his medical and qatar ID. he recently came and waiting for his QID. He can only get his passport by tomorrow evening. Please advice how he can go to india without his passport. Is there any procedure in Qatar that allows his to go.   Please advice.", "username": null}
{"comments": [{"comment": "@Molten Metal - Thank you for encouragement...", "username": "shahadat.hossain", "commentId": "comment-7391751"}, {"comment": "Excellent info ............. thanks .................", "username": "Molten Metal", "commentId": "comment-7391141"}], "question": "I wonder if any Qatar based company uses Big Data for their business management. I guess even some of them might use reticently but most of them still not even aware of it at all. However here I am going to publish a series of short articles which might come useful for the companies who still not aware of Big Data Potential. Well the initial question might like, WHAT IS “BIG DATA” ANYWAY? According to Wikipedia it is… Does it make sense? If not enough then read my favorite one that I often point as the “practical” definition to Big Data… Big data is a term used to describe the collection, processing and availability of huge volumes of streaming data in real-time. Companies are combining marketing, sales, customer data, transactional data, social conversations and even external data like stock prices, weather and news to identify correlation and causation statistically valid models to help them make more accurate decisions. Yeah that’s glittering? Now this is time to see one practical example of Big Data… Back in 1980 Wall Street shop keepers start complaining that every Saturday they find lowest sales than other days of a week! But surprising fact is their accountants report revenue of Saturday is just as usual as other days of week! That was pretty amazing! However some shopkeepers agreed to exchange their daily sales data to reveal actually what was getting traction and what is happening overall. The result of accumulation was pretty ridiculous! When they did some joint surveys they found every Saturday moms are buying baby diapers and putting those diapers in front of shops to be picked up by their husbands! For some unknown reasons parents were buying baby diapers only on Saturday. They were spending their outmost daily budget on baby diapers at Saturday so even though sales revenue from other products were down still gross sale is indicated as usual as other days of week. Actually this small piece of data can be extremely beneficial if you are willing to run a data driven business. Depending on this information you can take decision to store more diapers than any other products on Saturday. This might even increase your gross revenue at the end of the week. Therefore decisions can be influenced by Big Data. Larger companies already realized it that’s why they are putting a lot of money to get data from social medias and statistical consulting firms. On my next article I would point 10 practical advantages of Big Data which would put you 10 years ahead of your competitors. Mohammad Shahadat Hossain IT Engineer", "username": "shahadat.hossain"}
{"comments": [{"comment": "yes. Its my very first instance.", "username": "buttwaris", "commentId": "comment-7391191"}, {"comment": "But, Is it first time for you ? ........ Ask a friend to use her / his credit card .......... for one time ...........", "username": "Molten Metal", "commentId": "comment-7391096"}], "question": "Hi. Please somebody assist me in recharging my Nymgo Account. Where can i get Nymgo Recharge Coupons or Credit/Balance? I dont have any Credit Card/Debit Card. Any advice would be highly appreciated. Thanks in Advance.", "username": "buttwaris"}
{"comments": [{"comment": "Many advise against Souq Waqif because of the way the animals are kept there", "username": "britexpat", "commentId": "comment-7391436"}, {"comment": "Try in Souq Waakif, Timing 8am to 12noon / 4pm to 11pm", "username": "mnandgadi", "commentId": "comment-7391431"}, {"comment": "You are a caring person .. I can feel it my pal", "username": "muad-db", "commentId": "comment-7391146"}, {"comment": "Mas, That's being kind when you wish to give extra space to the pets ........... Joys .....................", "username": "Molten Metal", "commentId": "comment-7391126"}, {"comment": "I would steer clear of Souq Waqif .. Try Pets & more or Unique Pets", "username": "britexpat", "commentId": "comment-7391101"}, {"comment": "try souq waqif you will get there all kinds of animals and cages", "username": "mustafaamin", "commentId": "comment-7390991"}], "question": "Hello, i am looking for a pet store that sells small animals and big cages, i am looking specifically for a 24x24x36 cage, and also food,please tell me the location and please be specific, thank you!", "username": "Maso"}
{"comments": [{"comment": "Remember one 5 & three 0's ............ 5000 is your worth today plus the allowances ........... Do not accept even 1 Rial below 4500 if the concern is very reputed .............", "username": "Molten Metal", "commentId": "comment-7391936"}, {"comment": "Dear Jayakumargosangi, As per I know generally big firms here in Gulf hire much experienced person i.e 5+. 0-2 years is considered a novice experience.Regarding getting one year technician experience might help you to get a job in technician field in future or back in India.You can consider this as a internship.I am suggesting this because I know some people working in QP, Q gas etc how they got the job there. Better you double check with some electrical engineer here in Qatar to make sure that experience counts.I suggest better you look opportunities in India and or upgrade your skills.I am pretty sure , with the current economic scenario of Qatar , it will difficult for you in two years to get a decent job. Join if you think you have no other options left or if you can't sustain economically. I hope this helps", "username": "masax", "commentId": "comment-7391846"}, {"comment": "I agree with Anees. I too started my career at a very low level. I kept my head down, worked hard, gained some experience, had some cash coming into my pocket, kept looking around and after a couple of years managed to get the job that matched my qualification, Sitting at home and doing nothing will get you nothing in your pocket but much tension in your mind.", "username": "acchabaccha", "commentId": "comment-7391746"}, {"comment": "bro masax, thanks for your valuable advice. if i joined ther and came out of company after one year,so i will get experience na. they told me that they will giv noc after one year. is this technician experience is useful to me for future? is there any problem if my career start as technician and apply for engineer??? please tell me tq", "username": "Jayakumargosangi", "commentId": "comment-7391696"}, {"comment": "masax: Excellent advice ...", "username": "britexpat", "commentId": "comment-7391381"}, {"comment": "Do not join, It is a ridiculous offer , 2200 QAR is very less salary for an engineer whether it is a fresher or experience . A taxi driver earns morn than 2200 QAR with an accommodation .Better you upgrade your skills and look for any other job.Beware of the fact, you will need an exit permit from the employer to leave the country.Lot of things are tagged to Visa type, a technician Visa is a low skilled visa and barred you to lot many things like getting driving license , family visa (min income 10000 QAR) even if you are salary is increased more than 10k let suppose 5 years down the line, you will get problem in getting family visa due to type of visa you are holding. Conclusion : - If you want to live labor life then join else do not think about it.", "username": "masax", "commentId": "comment-7391371"}, {"comment": "There is no guarantee that you will get promoted or move up the ladder .. Think carefully before making the choice .. Good luck", "username": "britexpat", "commentId": "comment-7391346"}, {"comment": "thank you achhabacha", "username": "Jayakumargosangi", "commentId": "comment-7391321"}, {"comment": "thank you anees. you from? n wat u do", "username": "Jayakumargosangi", "commentId": "comment-7391306"}, {"comment": "You must start at some point so why not make a beginning. Gain some experience and then look around.", "username": "acchabaccha", "commentId": "comment-7391301"}, {"comment": "i posted bt qatarliving deleting it, dnt know whg.please suggest me to join or not Anees", "username": "Jayakumargosangi", "commentId": "comment-7391256"}], "question": "i done electrical engineering in india. recently graduated.have no experience. recently came to qatar. got offer as electronic technician at fmm. they pay twenty two hundred and allowences accdmtn.  as a engineer did i join ad technician???? is it effect my career or helpful?", "username": "Jayakumargosangi"}
{"comments": [{"comment": "Thank you so much for your responses. It is heartwarming to hear such coordinated action. The last time I remember I was holding it is near Jarir Bookstore Nasser and the bakala nearby. Next area will be New Slata are where I might have dropped it as I was disembarking the vehicle. Again, thank you so much and appreciate your help.", "username": "chcunanan", "commentId": "comment-7392081"}, {"comment": "Okay, It is final now, we a group of 6 friends will be going to the New Slata this eve, timings from 6 - 9 PM ............. will let you know about the outcome by 09.35 PM. .......", "username": "Molten Metal", "commentId": "comment-7391871"}, {"comment": "Cuna, We are so sorry to learn that you lost your wallet. One week lapse has made it tough to find your items. Anyhow please let us know the possible area where you could have dropped your wallet ? ....... Who else was with you at that time ? ......... We will go in that area after you guide us & try to comb the footpaths on both sides for the streets ... .... be hopeful many lucky guys had been able to get their lost items back by taking quick action ............", "username": "Molten Metal", "commentId": "comment-7391856"}, {"comment": "There are not one but TWO QLers who specialize in searching in finding lost items. They claim to have a \"team\" with whom they do this job. They never disclose their success rate in finding the lost items. It is surprising they have so far not come to your aid. Possibly, they will. Please be patient.", "username": "acchabaccha", "commentId": "comment-7391731"}], "question": "Good day to all. I hope this message finds everyone well. On 12th or 13th of September, last week, I believe I accidentally dropped my black wallet which is having my cards and some cash. Hoping that someone may have found it, you can contact me on this number: 3322 9814 Inside my wallet you can find my Qatar ID with my name: CHRISTIAN ALEX CUNANAN Thank you so much and I hope everyone have a great day.", "username": "chcunanan"}
{"question": "Can anyone recommend a ladies hairdresser (for cut and colour)- preferably in the Al Waab area? Thank you!", "username": "Becks44"}
{"comments": [{"comment": "Fhd, It is possible .......... be hopeful ......... make efforts .......... wish you succeed ............. joys .......................", "username": "Molten Metal", "commentId": "comment-7391886"}, {"comment": "Dear Sir, First go and approach the school since the procedure nowadays are doughier. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7391806"}], "question": "Can I get admission to 1st standard for my son without KG in Indian schools in Doha. Actually my son completed the KG1 from one Indian school in Doha before one year and pass to KG2 , But he didn’t joint KG2 , They went back to India . We paid 1st term fees of KG2 so that we got the books of KG2 and we teach him by our self all the subject . So my question is can we get admission in 1st standard without KG2 certificate in any Indian school Doha or KG is compulsory , I can arrange KG1 completion certificate from his old school  ", "username": "fhdaziz"}
{"question": "Hi, I am in search of B-Boying and Hip Hop Classes in qatar so that i can learn. Please provide suggestions regarding this.", "username": "CosmicHalu"}
{"comments": [{"comment": "It's so simple, no need to worry much my pal ................", "username": "Molten Metal", "commentId": "comment-7401081"}], "question": "Hello Friends, I am a mechanical engineer, working for Construction Company, want to register my self in UPDA (qatar). can you please share with me the question asked during the mechanoca exams. Rest all information I have but i need questions samples only. Will be thankful of yours.", "username": "Pratham Patil"}
{"comments": [{"comment": "Here in Qatar there is no New Zealand embassy, the only visa application center available in Dubai, UAE, Either you send hard copy of you application, or apply online but you have to send your passport there. This depend on your nationality, maybe you not require visa Good Luck", "username": "lion4lion", "commentId": "comment-7401206"}], "question": "I want to apply for visiting visa to visit New Zealand. Do any body know where can I apply her in Qatar", "username": null}
{"question": "Hi.. Does any one know about how to get a student visa to Spain? Or an agency that could do the paper work? I contacted VFS Global, but they did not seem to know and it is very difficult to contact the Spanish Embassy. Thanks", "username": "rashad.saintbai"}
{"comments": [{"comment": "Thanks for ur advice. Can you suggest names of these garages.. and do you have any personal experience with them", "username": "wackedmotor", "commentId": "comment-7401546"}, {"comment": "salwa road is best for AC repairs", "username": "haider114", "commentId": "comment-7401246"}], "question": "Hi everyone, can you please tell me a good reasonable place in industrial area to fix my car AC. I think it has a leak somewhere in the system.. I refilled AC gas twice in last 6 months..", "username": "wackedmotor"}
{"comments": [{"comment": "According to the labour law in Qatar working women are entitled to 50 days paid maternity leave, provided they have worked for their employer for a full year. HOWEVER - some companies terminate you prior to a year for other reasons to get round this. What reason has your company given for the termination...", "username": "britexpat", "commentId": "comment-7401291"}, {"comment": "If you are married fine, but if illegal then company may terminate you", "username": "lion4lion", "commentId": "comment-7401211"}], "question": "I'm working in a company for 11 months now and got pregnant. Can my company terminate me?", "username": "bonita Fitout"}
{"comments": [{"comment": "Dear Sir, Please contact to the below address for acoustic foam. Karmah Trading & Services 00974 44505 001 00974 44505 002 Fax: 00974 44505 003 P.O.Box : 10672 DOHA - QATAR Email : info@kts-qatar.com Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7401521"}], "question": "Please let me know where can i get Acoustic foam (white color) in doha  ", "username": "infoquecity"}
{"comments": [{"comment": "Very well said @ Molten Metal......", "username": "Musty09", "commentId": "comment-7412371"}, {"comment": "Yes Brity is right apply direct and don't get scammed", "username": "zackm", "commentId": "comment-7402241"}, {"comment": "15k to 20k QAR", "username": "Souma87", "commentId": "comment-7401671"}, {"comment": "15k to 20k ....... which currency ? ........", "username": "Molten Metal", "commentId": "comment-7401626"}, {"comment": "Sou, Postpone you idea for 3 months, think again. Canada is totally different than Qatar. Weather is an issue for Canada. You will be cut off from your parents is the second demerits ........ ........ The most important is your professional life ....... you might be asked to start from the scratch ........ ...... your qualification & experience will be dashed to ground the moment you touch down at one of their airports ....... ...... job culture is so strange you will think about returning back to Qatar before the sun sets down ....... expenses are too high .... people go to US to buy grocery items ............. what I told you is not a secret ...... people who return or visit their home countries always hide the facts ...... ... .. they are ashamed of their wrong decisions ....... ....... their spouses are going their separate ways , kids also don't care for the parents once they touch the teen years .... ... If you ask me all they have all the demerits as compared with the secure & safe life in Qatar ...............", "username": "Molten Metal", "commentId": "comment-7401606"}, {"comment": "Immigration to Canada: Thank you Britexpat. I have diploma in Mechanical engineering and my wife has master degree in statistics. First they told me that it is better to be my wife the first applicant because the Master degree will give more points. Second, they gave me general idea about the express entry, it will take 9 months to get acceptance as they have mentioned !! After that ,They told me that the payments will be divided into 5 steps , and at each step if they reject the application for some reason, the money will be refundable!! :O :O . 15k to 20k will cost in total !!!", "username": "Souma87", "commentId": "comment-7401386"}, {"comment": "Immigration to Canada: Thank you Britexpat. I have diploma in Mechanical engineering and my wife has master degree in statistics. First they told me that it is better to be my wife the first applicant because the Master degree will give more points. Second, they gave me general idea about the express entry, it will take 9 months to get acceptance as they have mentioned !! After that ,They told me that the payments will be divided into 5 steps , and at each step if they reject the application for some reason, the money will be refundable. 15k to 20k will cost in total !!!", "username": "Souma87", "commentId": "comment-7401376"}, {"comment": "Don't waste your money on these frauds.", "username": "omarm88", "commentId": "comment-7401366"}, {"comment": "Firstly, how did your initial consultation go ? Were you impressed by them ? Secondly, you can always apply for yourself through the CIC website. Thirdly, see links: http://www.qatarliving.com/community-group/qatar-community-indians/posts/stratix-fraud-immigration-consultancy http://www.canadianvisareview.com/review/stratix-consultants/", "username": "britexpat", "commentId": "comment-7401361"}], "question": "I would like to ask if you have any experience or if you know Stratix Consultants? Came across the organization through a Facebook ad and visited their office for a free initial consultation for Canadian emigration under express entry program.. If anyone has any information please share it,, thank you ! ", "username": "Souma87"}
{"comments": [{"comment": "life expenses are not my main concern. right now the company provides me with accommodation, but its shared 2 bed apartment with 1 other person. as a married person am i entitled to ask for accommodation allowance, and if you what percentage should i expect. as for the visa the company has already approved a family visit visa so that is not an issue either.", "username": "nabilnabulsi", "commentId": "comment-7401676"}, {"comment": "WT, You need to count the wife's income as well ................. .... your worries are un-founded ...............", "username": "Molten Metal", "commentId": "comment-7401656"}, {"comment": "Okay Nabil, Follow Brit ....... It's better if you go for HR executive's short term course to understand the other dept.'s responsibilities ....... ........ ... other areas are medical, security etc where you may think to get the basic knowledge. ..... ..... before you apply the visa for your spouse ........... Good luck & joys ......... Expect your wife to be here in early 2018 ..{ yes 2018 } ........ !", "username": "Molten Metal", "commentId": "comment-7401646"}, {"comment": "You are entitled to nothing. The only thing you are entitled to is that life will become more expensive now.", "username": "Wild Turkey", "commentId": "comment-7401641"}, {"comment": "MM is wrong. You are entitled to benefits as per your contract . If your contract stipulates that if married , you can avail these benefits , then you can ask them to be initiated .. If your contract states bachelor status , then you can approach your management and HR to modify your contract and benefits .. It is up to them to agree", "username": "britexpat", "commentId": "comment-7401611"}, {"comment": "Congrats, Yes, You are entitled to HRA, her tickets, medical, club membership to begin with .......... Contact the HR girls tomorrow afternoon ...........", "username": "Molten Metal", "commentId": "comment-7401596"}], "question": "HI TO ALL.   Am here on a working visa like most of all of us, I hold a managerial  position, and  a bachelor package.  Been here for 3 years. Recently i got married. And I want to bring my wife to stay with me. My question is am i entitled to ask for family allowance from my company, or any other benefits??", "username": "nabilnabulsi"}
{"comments": [{"comment": "Dear Sir, Ask your previous company to \"open\" the company's computer card ( قيد المنشأة ) at immigration office. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7405226"}, {"comment": "Go tol the Human Rights Commission .. or ask your old company management to renew computer card", "username": "britexpat", "commentId": "comment-7404936"}], "question": "Hi everybody.I got all documents from my company to transfer to other company.But now my old company is closed.So i cant transfer because the old company computer card is  closed,so suggest me what is the way for this.", "username": "arfath deen"}
{"comments": [{"comment": "Why not visit and existing Dojo and talk to the owner about setting up a similar business Visit / contact the Chamber of Commerce and ask for their advice", "username": "britexpat", "commentId": "comment-7405586"}], "question": "", "username": "shanjoseph"}
{"comments": [{"comment": "Just wait three days and VFS will call you soon.", "username": "Wild Turkey", "commentId": "comment-7405171"}, {"comment": "I'll call VFS and ask them , then come back to you", "username": "britexpat", "commentId": "comment-7404586"}], "question": "Can someone advise what is the duration (Number of days) it takes for processing the Business visa for Indian National to Spain via vfs office in Qatar ?", "username": "Highlondon"}
{"comments": [{"comment": "It is best to call one of the other driving scools and find out first hand", "username": "britexpat", "commentId": "comment-7405306"}], "question": "I was went training for driving here in Doha. Unfortunately not get license even after trying hard since 18 months. I want to change the school (As my 4 attempt were finished in ROAD TEST,I dont wanna continue in that school as I am suffered lot there) my question is : Can I join new school with New Admission record or I should continue my existed admission record,,?", "username": "factmachine"}
{"comments": [{"comment": "eeeiya ooova hu, hu", "username": "karoly", "commentId": "comment-7405341"}], "question": "", "username": "shanjoseph"}
{"comments": [{"comment": "Dear Sir, It good that you got information from current employee through iswariya. Due to current economy & market situation, many reputed companies with good standing are facing problems. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7405236"}, {"comment": "Hi good company good salary not bad food room free for bachelor no idea about family accommodation,, my friend s working now they got good job for future projects we heard,, joyysss", "username": "iswariya", "commentId": "comment-7405071"}, {"comment": "Hi good company good salary not bad food room free for bachelor no idea about family accommodation,, my friend s working now they got good job for future projects we heard,, joyysss", "username": "iswariya", "commentId": "comment-7405066"}], "question": "Hi QL friends do you any one know about the company ETS (Energy Technical Services ), I looking Feedback/ information about the company for my friends who is living in qatar with family and he is planning to join with ETS. As we know well about the current situation of Job market in qatar. Is it advice able to switch to new at this time. Seriously looking valuable advice in this subject.", "username": "psrsekar"}
{"comments": [{"comment": "Dear Sir, Here's some useful advice about how to get a health card. First, you must have a valid Qatar residency permit. To apply for a health card you will need to supply the following documents with your application: - Copy of applicant's passport - Qatar ID (issued when you get your RP) - Two photographs (4x3 cm, blue background) - QR100 fee - Copy of water and electricity bill to confirm your address - Children need valid birth certificates and vaccination cards Once you have gathered all the documents you need and completed the application form, it is time to find your nearest primary medical centre. Remember to take all your documents and make sure you go in the morning, as they do not accept health card applications in the afternoon. Early morning is best, as each centre will have a different cut-off time for accepting applications. Once you have submitted your application forms, your health cards will be issued on the spot ( In some cases, the card can be collected within 2 weeks). Children born in Qatar do not require a health card and all medical treatment and medicines are free for their first year courtesy of HMC. Renewing your health card is a simple process and can be done immediately at all HMC health centres and hospitals. You can also renew your health card online or at any Qatar General Post Office. If renewed online or at the post office, the card will be delivered within two to three weeks of submitting the application. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7405831"}, {"comment": "Thank you", "username": "iswariya", "commentId": "comment-7405596"}, {"comment": "Its possible to search QL and get all the info .. http://www.qatarliving.com/forum/welcome-qatar/posts/process-get-hmc-health-card http://www.qatarliving.com/forum/welcome-qatar/posts/renewing-or-replacing-your-health-card", "username": "britexpat", "commentId": "comment-7405551"}], "question": "", "username": "iswariya"}
{"comments": [{"comment": "They will ask for rent agreement", "username": "Aone1", "commentId": "comment-7407781"}, {"comment": "I have a doubt that they will ask for rent agreement also or without they can accept the application.", "username": "aswanika", "commentId": "comment-7407101"}, {"comment": "Thanks friends for your quick support, I have a doubt that they will ask for reng agreement also or without they can accept the application.", "username": "Aone1", "commentId": "comment-7406041"}, {"comment": "Aone1,,,,,, Plz check inbox in ql for ur query v r having same issue..", "username": "iswariya", "commentId": "comment-7405776"}, {"comment": "U have family accommodation?", "username": "iswariya", "commentId": "comment-7405601"}, {"comment": "Yes, its true.. Goodluck!", "username": "Careers1", "commentId": "comment-7405566"}, {"comment": "ys you will get it easily........apply quickly otherwise they will change rule after dec 13..............", "username": "syamrajman", "commentId": "comment-7405561"}, {"comment": "You heard right..", "username": "britexpat", "commentId": "comment-7405481"}], "question": "Friends, I need an advice regarding family visa (RP), how much minimum salary should be of sponcor to get RP for family. I heard if the salary is QR. 7000/- also you are in company family accomodation that you can get family RP easily. Please privode the updated nessesarily information.", "username": "Aone1"}
{"comments": [{"comment": "Try Lulu D Timg Road my pal", "username": "muad-db", "commentId": "comment-7406136"}, {"comment": "Try Lulu D Timg Road my pal", "username": "muad-db", "commentId": "comment-7406131"}, {"comment": "There may be two places where you could find them. One of them are the small shops that do shoe repairing and there are many of them in and around Doha. Another place may be the shops that sell safety shoes. You may also try out shops that sell men's shoes.", "username": "acchabaccha", "commentId": "comment-7406051"}], "question": "dear fellow inhabitors of wonderful Qatar, does anyone know where one could procure a quality shoe lace, though i say shoe lace i actually mean a lace suitable for a boot that is worn during daily duties on one of the many construction sites here in Qatar?", "username": "sir Richard Head"}
{"question": "", "username": "akram.adnan"}
{"question": "I am looking for nursery for my 2.5Y baby. Prefer South Asian and location Mesameer, Abu Hamour, Ain Khaled area. Anyone of you can recommend me a place with contact numbers.", "username": "fifaqatar2022"}
{"comments": [{"comment": "Dear Sir, You'r always welcome. All govt. transaction by card. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7408351"}, {"comment": "Thanks sheen for your response. Payment is by cash or card?", "username": "santhoshcbe77@gmail.com", "commentId": "comment-7408301"}, {"comment": "Dear Sir, Make the rental contract carry landlord and your ID's to Kharama office in D-Ring road 2000 Qr. you have to keep deposit Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7408216"}], "question": "Guys, I want to change the kharama bill under my name. Please let me know the documents required and location of kharama office and timings. What is the deposit amount? How much time the process will take", "username": "santhoshcbe77@gmail.com"}
{"comments": [{"comment": "QL isn't Doha News, brit.", "username": "Wild Turkey", "commentId": "comment-7407951"}, {"comment": "How about QL going out and inteerviewing a few people and letting us have their experiences first hand ...both good and bad !", "username": "britexpat", "commentId": "comment-7407871"}], "question": "Qatar has a large expatriate population, and a good percentage of this consists of migrant workers. But what about regular middle-income expats, or even higher-salaried ones? Everyone has rights, and NHRC is here to ensure that your rights are taken care of. The National Human Rights Committee (NHRC) is a government-appointed human rights commission based in the State of Qatar. Established in 2002, it has been tasked with the responsibility of overseeing and carrying out investigations on human rights abuses in the country. The commission's aims revolve around raising awareness of human rights abuses, monitoring and observing human rights abuses, and empowering individuals. Their means of advancing this goal include contributing to research programs related to human rights, conducting studies and providing advice and recommendations to legislative bodies. The NHRC also advocates for the rights of individuals with disabilities. Expat life in Qatar is not without its problems, and while a lot of people do not, or are too scared to avail NHRC services, this organization has come to the rescue of a large number of expats and migrant workers. Be it employment issues, payment problems, or any thing that can be classified as human rights' violations, the NHRC does its due diligence in ensuring that all needs are met. For those who are wondering, you do not have to file any official complaints, and the NHRC is available just for a consultation as well. You can walk in during their operating hours from 7am – 1pm and ask them or discuss whatever your problems might be. The men's section is usually crowded, and the wait might be longer, however the ladies section is fairly free, and the staff addressing your issues will be women as well. There is no fee and services are provided free of charge. They also do not ask for any personal information like ID card number, passport etc, while discussing your troubles. If you think you are in trouble, do not hesitate to reach out to them. NHRC might be the best option for you, to get any kind of help in resolving the situation you are in. The NHRC is located in Markhiya and Fereej AbdulAziz areas.", "username": "QL Team"}
{"comments": [{"comment": "Dear Sir, We will do very competitive price. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7408456"}, {"comment": "what about printing documents?", "username": "Muhammad Afnan 1994", "commentId": "comment-7408056"}, {"comment": "There are so many of them around Doha. Usually, most photography shops have photocopying machines. The cost of photocopying 100 pages would be around QR 50 maximum. You could negotiate and get it done for QR 40.", "username": "acchabaccha", "commentId": "comment-7407986"}], "question": "Hello All, I want to know cheap printing/copying shops here and their charges .I want to print almost 100 pages(A4) in total .", "username": "Muhammad Afnan 1994"}
{"comments": [{"comment": "Dear Sir, Report has been released by The Traffic Department saying that the driving licenses of expats from the GCC countries cannot be converted into Qatari Driving licenses. One needs to be a GCC Citizen in order to be eligible for this license conversion. Qatar residents permit holders who hold valid GCC driving licence can still take the direct test, failure to pass this test means they have to take the full course. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7408521"}, {"comment": "Residents who hold valid GCC driving licence can take the direct test - Pass the theory first. No lessons required", "username": "britexpat", "commentId": "comment-7407746"}, {"comment": "No. You will need to go through a driving school to get a Qatari driving license. You may opt for a short course. You can have all the details from any of the driving schools in Doha.", "username": "acchabaccha", "commentId": "comment-7407736"}], "question": "I have valid saudi driving licence. I am in Qatar now with engineer profession. Can I get any exemption to obtain qatar driving license. What is the procedure of obtaining qatar driving license if I have valid saudi driving license.", "username": "kash67"}
{"comments": [{"comment": "Dear Sir, Yes you can. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7408526"}, {"comment": "yes u can apply family visa for more info and details of req. feel free to contact me in my mobile #66957271", "username": "Alostoora Travel and Tourism", "commentId": "comment-7408011"}, {"comment": "yes you can apply for family visa.", "username": "Ali.pk", "commentId": "comment-7407801"}, {"comment": "then u r engineer too .. so check what degree in degree and visa whether it Match. .", "username": "iswariya", "commentId": "comment-7407791"}, {"comment": "u can apply for permanent visa no issyes in ur employement contract u c how much totally", "username": "iswariya", "commentId": "comment-7407786"}], "question": "My basic salary is QR 7000, but my gross salary is more than QR 10000. My profession is engineer. Can I apply for family visa", "username": "kash67"}
{"question": "Need to secure full time maid / nanny by December. Internet only gives phone numbers.  Prefer to get advice from those already used such service or indeed may have a recommendation for a suitable candidate?", "username": "BLS62"}
{"question": "", "username": "ENG.BADR86"}
{"question": "Coal Cosmetic :- The supposed free radicals - dynamic types of oxygene which can devastate cells and prompt malignancy improvement. Obviously, this impact underlies lycopene's anticancer activity. It has for some time been perceived that individuals taking after the alleged tomato-rich \"Mediterranean\" eating routine, experience the ill effects of a lower rate of heart or circulatory-related infections. Exploratory looks into of the Mediterranean eating routine have uncovered that the tomato-inferred cancer. Read More >>> http://www.prohealthguides.com/coal-cosmetic-moisturizer-reviews/", "username": "wctonlame"}
{"comments": [{"comment": "Dear Sir, For compelte details of attestation of educational documents, please send us test mail at Attestation@SheenServices.com. We will revert with in-depth information. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7411906"}, {"comment": "While giving attestation they are asking three documents buy while applying permanent no need of mark sheet only degree certificate no worries..", "username": "iswariya", "commentId": "comment-7410036"}, {"comment": "Final Year Marksheet also require to be attested?", "username": "Aone1", "commentId": "comment-7410031"}, {"comment": "WT: I agree that it is overkill .. However, I believe it is because of the large number of forged degrees floating around .", "username": "britexpat", "commentId": "comment-7409961"}, {"comment": "This is kinda idiotic.", "username": "Wild Turkey", "commentId": "comment-7409951"}, {"comment": "ya now a days for family visa degree certificate attestation is not enough u shd get attested ur final consolidate mark sheet u shd get bona-fide in ur college and attest", "username": "iswariya", "commentId": "comment-7409741"}], "question": "", "username": "timbi"}
{"comments": [{"comment": "I think bulldogs are banned in Qatar. But you can always go to a government website to find out.", "username": "Wild Turkey", "commentId": "comment-7410121"}, {"comment": "Welcome here ........ it is better to get your self introduced to this place first ........... only then you may bring along all your loved ones .................", "username": "Molten Metal", "commentId": "comment-7410086"}], "question": "Hi All,  I'm moving to Doha in a few months, and I'd really like to get a French bulldog puppy. Are there any French bulldog breeders in Qatar? What about bringing one from abroad?", "username": "brandonofcanada"}
{"question": "Can anyone advise me how to grill chicken and other stuffs in Glem Gas cooking range?", "username": "rejus939"}
{"comments": [{"comment": "Dear Sir, If you are working for Qatar government and in your labour contract it is mentioned that accommodation will be provided by government then you don't need to submitted Municipality attested rental agreement otherwise if you working for private sector, then you will have to have in your name, water & electricity bill along rental agreement attested by Municipality. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7411871"}, {"comment": "santhoshcbe, In NOC they r writing that accomodation provided by the company but in rental agreement only me and the landlord means other party (No company details as landlord in rental agreement) so that they will accept?", "username": "Aone1", "commentId": "comment-7411351"}, {"comment": "But be aware of Qatar rules .It changes every now and then.So please confirm with immigration dept at gharaffa", "username": "santhoshcbe77@gmail.com", "commentId": "comment-7410766"}, {"comment": "Request your company to provide a letter mentioning that accommodation is provided by them.then no issues I think. Otherwise rental agreement should be in your name attested by baladiya .", "username": "santhoshcbe77@gmail.com", "commentId": "comment-7410761"}, {"comment": "As i knw if the accomodation provided by the company and salary is below 10k but above 7k than u sud have rental agreement but the point is if the rental agreement is not showing anything about company than can apply, means in rental agreement only tenent and landlord nothing about company name.", "username": "Aone1", "commentId": "comment-7410251"}, {"comment": "@ iswariya please check inbox", "username": "aswanika", "commentId": "comment-7410186"}, {"comment": "C inbox aswanika", "username": "iswariya", "commentId": "comment-7410161"}, {"comment": "please suggest any expert about the rental agreement, m also having same issue.", "username": "aswanika", "commentId": "comment-7410136"}, {"comment": "They need the rental agreement attested from the Ministry of Municipality (Baladiya)", "username": "Happy Shah", "commentId": "comment-7410131"}], "question": "Friends, If someone is getting salary QR. 7100 and would like to apply for family permanent visa (RP) and the accomodation is provided by the company but his rental agreement is not provided by the company directly, only in tenent (Me) and landlord (Other than company) and in rental agreement there is nothing describe about my company but in NOC they are writing that accomodation provided by the company than can he apply ??? Please give your suitable comments and advice.", "username": "Aone1"}
{"comments": [{"comment": "Correct, go for the plain , mirror finish .......... super clean ..................", "username": "Molten Metal", "commentId": "comment-7411261"}, {"comment": "Don't go for the grainy texture .. It can scuff the knees if doing naughty things on the floor", "username": "britexpat", "commentId": "comment-7409956"}], "question": "Hi everyone..when buying linoleum, i saw a wood finish linoleum with grainy texture.. It's really nice.. But should i go for this or the plain finish one? My concern is if dust will build up in the grains and cleaning will be difficult? ", "username": "nikhilamgeorge"}
{"comments": [{"comment": "Very well explained, Messrs. Sheen Services WLL. Thanks to you for giving clear thoughts about Network Marketing. Our company (UNO Premier) is a dynamic marketing company that derived its innovative business model from a very long history and foundation of Leadership, Management and Entrepreneurial Vision. UNO Premier’s Mother Company, UNO, started its rising 9 years ago (in the Philippines) and blossomed throughout the network industry like a rapid fire. It became a network marketing sensation and has created over a thousand Philippine millionaires in less than a decade’s time and have expanded in over 100 offices across the country. From the foundation of UNO comes the birth of UNO Premier in 2013! UNO Premier is specifically designed to engage the International Market and the like-minded middle class professionals as well as business owners in the micro, small and medium scale enterprises. We have branches internationally in Singapore, Hong Kong, Macau, USA, UK, UAE, Nigeria, Papua New Guinea and Qatar to name a few. By carefully putting together the essential building blocks of Products, Services, Marketing Management and a powerhouse Compensation structure, UNO Premier is positioned to the top of the Elite and separates itself from the common traditional network marketing programs you see today. The Company’s objective is to be the world’s leading provider of wealth creation opportunities. In this tough industry, UNO Premier will set a new pace in helping people achieve their goals and dreams, changing lives, creating time freedom and bring people a peace of mind. UNO Premier is poised as the next big international giant to create the next wave of millionaires. www.unopremier.com", "username": "tob_cam", "commentId": "comment-7412326"}, {"comment": "Is Network Marketing Just a Scam? There's a huge difference between network marketing and pyramid schemes. Learn the truth here. Q: Some friends continue to try to recruit me into network marketing deals that seem like some type of money game or pyramid. Other friends tell me they're illegal and I'll get into trouble. How do I know what's legal and legitimate? A: To help you understand what network marketing is, I must first explain what it isn't. First, network marketing isn't a pyramid scheme. Pyramids are programs similar to chain letters where people just invest money based on the promise that other people will put in money that will filtrate back to them and somehow, they'll get rich. A pyramid is strictly a money game and has no basis in real commerce. Normally, there's no product involved at all, just money changing hands. Modern-day pyramids may have a product, but it's clearly there just to disguise the money game. Network marketing is a legitimate business. First, it's based on providing people with real, legitimate products they need and want at a fair price. While some people do make a lot of money through network marketing, their financial benefit is always the result of their own dedicated efforts in building an organization that sells real products and services. Pyramids are illegal and are based on taking advantage of people. For a person to actually make money in a pyramid scheme, someone else has to lose money. But in network marketing, each person can multiply his or her efforts, skills and talents by helping others be successful. Network marketing has proved itself as part of the new economy and a preferred way to do business here and around the world. Network marketing isn't about taking advantage of your friends and relatives. Only a few years ago, network marketing meant retailing to, and sponsoring people from, your \"warm list\" of prospects. Although sharing the products or services and the opportunity with people you know is still the basic foundation of the business, today we see more people using sophisticated marketing techniques such as the Internet, conference calling and other long-distance sponsoring techniques to extend their network across the country. Network marketing isn't a get-rich-quick scheme. Of course some people do make large amounts of money very quickly. Many would say those people are lucky. But success in networking isn't based on luck. (Unfortunately, money won't sprout wings and fly into your bank account no matter what someone has promised you.) Success in network marketing is based on following some very basic yet dynamic principles. Now let's discuss what network marketing is. Network marketing is a serious business for serious people. It's a proven system where the design, creation and expense the corporate team has gone through becomes a road map for your own success. Just follow the simple, proven and duplicable system that the good companies provide. The real key is this: Network marketing is all about leverage. You can leverage your time and increase the number of hours of work effort on which you can be paid by sponsoring other people and earning a small income on their efforts. J. Paul Getty, who created one of the world's greatest fortunes, said \"I would rather make 1 percent on the efforts of 100 people than 100 percent on my own efforts.\" This very basic concept is the cornerstone of network marketing. For example, most successful people building a network marketing business do so in an organized method. They work a few dedicated hours each week, with each hour of effort serving as a building block for their long-term business growth. Then they sponsor other people and teach those people how to sell the company product and sponsor others who duplicate the process. By helping the people you personally sponsor to sponsor others, you duplicate yourself. As this process continues, you create compound growth that can lead to hundreds or even thousands of people coming into your business. You leverage your time by helping others be successful and earn an income from all their efforts. With network marketing, there are no big capital requirements, no geographical limitations, no minimum quotas required and no special education or skills needed. Network marketing is a low-overhead, homebased business that can actually offer many of the tax advantages associated with owning your own business. Network marketing is a people-to-people business that can significantly expand your circle of friends. It's a business that enables you to travel and have fun as well as enjoy the lifestyle that extra income can provide. Michael L. Sheffield is the founder of Sheffield Resource Network, a full-service multilevel marketing consulting firm in Tempe, Arizona. He is also the co-founder and chair of the Multi Level Marketing International Association (MLMIA), whose members represent companies throughout the world.", "username": "Sheen Services WLL", "commentId": "comment-7412276"}, {"comment": "Why not invest your money in Network Marketing? For a very minimal investment, the potential income is huge (e.g. your Investment of QR 13K+ can give you a potential income of QR 178K per month). And this is no joke. There is a legitimate Network Marketing company existing here in Qatar. I can help you out on the processes. (Note: Whatever transaction you will do with your investment, will be done through the company only, and not with me).", "username": "tob_cam", "commentId": "comment-7412191"}, {"comment": "Which mutual funds? Could you name a top few?", "username": "batman007", "commentId": "comment-7409296"}, {"comment": "Bat, Mutual Funds is the best option. Bank FDs, Provident Funds will get you nothing ........... 7 - 8 % is actually a negative figure .... How ? ....... because of inflation .............. Simply look here, what you get for 100 Rials today for example, will cost you 110 - 115 by the next year .......... so you can't say your future will be comfortable with banks schemes. You will have to go for MFs where you get 15 - 20 - 30 - 40 - 50 - 60 - 70 - 100 % kind of returns ..... over a longer period of time ..............", "username": "Molten Metal", "commentId": "comment-7408506"}, {"comment": "Muad, You have stolen my comments again ....... !! Okay, tell us which country's mutual funds ? ...... Dubai's , Oman's ........... ? ........ Please .......", "username": "Molten Metal", "commentId": "comment-7408496"}, {"comment": "Dear Sir, Economy is bad condition, keep the money in form of cash or gold. Even in good times, be active partner were you have complete access to accounts. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7408316"}, {"comment": "Save your money and invest in mutual funds my pal .. Much better returns", "username": "muad-db", "commentId": "comment-7408051"}], "question": "", "username": "batman007"}
{"comments": [{"comment": "If you haven't taken any such courses / training , then how can you get the certificates ?", "username": "britexpat", "commentId": "comment-7411436"}], "question": "I'AM Going to change my profession .I want take qatar driving license but my profession is scafolder . when i was go to propose for proffesion chang the labor office they told me yo have to  show formen or maneger ceartificates by attestation but i dont know . How can i get formen or manager  certificates  with stamp by administration...thanks ..  ", "username": "nijumok"}
{"question": "Friends what is the current market salary of the following jobs Receptionist Secretary Admin officer HR executive Document Controller Purchase executive Sales man Sales Coordinator", "username": "minnysantos"}
{"question": "", "username": "ahmed farhan"}
{"comments": [{"comment": "And your question is ?", "username": "britexpat", "commentId": "comment-7411661"}], "question": "", "username": "ryanmarollano"}
{"question": "Can anyone here please tell me where I can get Ganodema coffee or product here in Doha, Qatar.", "username": "olajideshuaib"}
{"comments": [{"comment": "hi u do attestation in ur. bona-fide too now it is important afterwards while taking family it l b easy lol", "username": "iswariya", "commentId": "comment-7413181"}, {"comment": "Dear Sir, Please send a test mail to Attestation@SheenServices, we will revert with complete details. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7411846"}], "question": "Good morning, I want to do attestation for consolidated marks sheets from Delhi..Before this shell I need to do University attestation also? Is it mandatory? Because for my degree certificate I had followed this procedure..please clearify", "username": "ahmed farhan"}
{"question": "Hi , I will be travelling to UAE next week via Qatar . I will have to wait 8 hours to get on to UAE flight. can I get a short term visa to go out side the airport to see my cousins? Thanks in advance", "username": "firdous7862"}
{"comments": [{"comment": "message coming often don't bother delete b cool", "username": "iswariya", "commentId": "comment-7413176"}, {"comment": "They will never stop because it is easy money for them", "username": "britexpat", "commentId": "comment-7412736"}, {"comment": "@muad-db I am aware of that. +91 is india. When will they stop scamming.", "username": "Lakshan SJ", "commentId": "comment-7412726"}, {"comment": "It's a scam.. If you believe this then I have a bridge in London I have for sale", "username": "muad-db", "commentId": "comment-7411701"}], "question": "They call and tell you have won 2M riyals. Copy the url below for picture. lh3.googleusercontent.com/PVhp0KOovCHEfKKU2Qio-4MrMKvbDoBvem1ZyWMY-XxSPaAE5C88KMuLtsMUGmISnI16=s800", "username": "Lakshan SJ"}
{"question": "Dear, Plasti Dip (Rubber Coating Aerosol) its available in Doha? how much the price?... thanks", "username": "hafidulazadt"}
{"comments": [{"comment": "Dear Sir, After 13 Dec, 2016 if you have completed your labour contract then you will get NOC from Ministry of Labour, Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7412491"}, {"comment": "As the law currently stands, your company is not obliged to give you an NOC ...", "username": "britexpat", "commentId": "comment-7411976"}], "question": "", "username": "fasithsyed"}
{"comments": [{"comment": "hi this is angel of alostoora travel and toursm.. if u need visa assistance to re apply for another family visa.. you may free to call me in my mobile #66957271.thank u", "username": "Alostoora Travel and Tourism", "commentId": "comment-7414031"}, {"comment": "Extension s easy in wakra , last month is 6th month I went to wakra I told extension after 6 months tgey took token no appln they told to c captain he didnt ask anything gave immediately I paid card", "username": "iswariya", "commentId": "comment-7412566"}, {"comment": "Thanks Sheen, I will plan accordingly", "username": "maaa123456", "commentId": "comment-7412476"}, {"comment": "Dear Sir, You can extend your family visa beyond 6 months also. With extension application you have to meet Nasser Al Athya in First Floor, building number one, Immigration office, Gharafa. You can apply for new family visa only after they exit the country. Best is to give 7 working days gap before applying but sometimes even next day application is also accepted. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7412471"}, {"comment": "Thanks a lot Brit", "username": "maaa123456", "commentId": "comment-7412241"}, {"comment": "You have to wait for the expiry of the current visa.. Then you can apply straight away after exiting the country", "username": "britexpat", "commentId": "comment-7412036"}], "question": "Dear All, visit visa for my wife and daughter is going to expire on 25th November after completion of 6 month. I want to apply same for next 6 months (1+5). Can I apply for their visa before expiry of their current visa and I ask them to exit country before 17th. and very next day they can come with new VISA?", "username": "maaa123456"}
{"comments": [{"comment": "Dear Sir, As per Qatar rental law you will have to pay compensation to landlord has you are breaching the contract. Regards, Sheen Services WLL www.SheenServices.com", "username": "Sheen Services WLL", "commentId": "comment-7415181"}, {"comment": "Naf, Be friendly with the people when leave any place ................ ..........", "username": "Molten Metal", "commentId": "comment-7414586"}, {"comment": "Basic - Please check your tenancy contract what is the termination clause. If you have signed without this clause then you can't cancel in the middle unless you prove the landlord that you are leaving Qatar for good and produce visa cancellation copy later.", "username": "Syed01@yahoo.com", "commentId": "comment-7414526"}, {"comment": "Just manage out for the rest of the contract period rather than get into an issue with the landlord. During the last month of the contract, make an effort to find an alternate accommodation while serving the landlord a notice. And make sure there are no \"bachelors\" living in that area where ever you find your new accommodation.", "username": "acchabaccha", "commentId": "comment-7414436"}, {"comment": "Naf, Have a 2nd meeting with LL at a dinner table, start the talk after he finishes his dinner & begins to eat the sweet dish ........ you will get a relief for 2 months ......... call him once again next week ...... offer one more dinner to get back the 3 months rent ....... try this strategy ......... and revert .........", "username": "Molten Metal", "commentId": "comment-7414361"}], "question": "i would like to know what I can do to terminate my lease agreement 4 months earlier as I am quite disturbed with all bachelors staying in my neighborhood, and the landlord has been increasing rent regularly and I have found a house with lower rent and a good location. I asked my landlord n he says to pay for next 4 months n vacate?? Any solutions", "username": "nafdoh"}
{"comments": [{"comment": "All you need is a small hammer my pal , before that tighten the string then hit at the rollers ......... try today ...... wish you success ...............", "username": "Molten Metal", "commentId": "comment-7414376"}, {"comment": "Rizks was talking to a young lady the other day, telling her about his Tabla :O(", "username": "britexpat", "commentId": "comment-7414136"}, {"comment": "What happened to your tabla? Is it out of scale? or do you want to tune it to some other scale?", "username": "ani_chy", "commentId": "comment-7414101"}], "question": "Ï need someone to help me tune my \"Tabla'\" . Any help near Al Thumama / Al Hilal Old Airport Area or nearby shall be welcome. ", "username": "avinashjdeshpande"}
{"question": "I want to purchase Himalaya pharma's Karela in Doha.(bitter gourd tablets).Where is it available?", "username": "dhruba001"}
{"comments": [{"comment": "Dear Sir/Mam, Please contact +97474050905 (whats app available Also)", "username": "sajid1199", "commentId": "comment-7416236"}, {"comment": "Why waste money my pal .. Make your own decirations and have fun too", "username": "muad-db", "commentId": "comment-7415276"}], "question": "Need help to decorate for a Birthday party decoration with Table and give AWAYS. Any contacts please.", "username": "prabhugudavalli"}
{"comments": [{"comment": "http://nricafe.com/ooredoo-offers-cricket-world-cup-channel-free/", "username": "britexpat", "commentId": "comment-7413736"}, {"comment": "Hi, I think you will have to get OSN, they show cricket. Myself I just watch online, not ideal but works", "username": "omarm88", "commentId": "comment-7413731"}], "question": "Hi, we just moved here, signed up with Ooredoo and are wondering about what sports channels we should subscribe to. It seems to me bein only really does soccer. What channels show cricket? particularly England games. Thanks in advance", "username": "foleyco"}
{"question": "Good evening guys Is there any course in Qatar which provide teaching licene?? Because I saw in many jobs requirement they are asking licene.let me know thank you", "username": "mohammed makeen"}
{"comments": [{"comment": "Mistakes can be very Fatal.", "username": "Lucky Luciano", "commentId": "comment-7416381"}, {"comment": "http://www.mme.gov.qa/cui/view.dox?id=700&siteID=2", "username": "britexpat", "commentId": "comment-7416321"}, {"comment": "What do you need to complain about my pal .. Perhaps it's a mistake ..", "username": "muad-db", "commentId": "comment-7416316"}], "question": "", "username": "newadddoha"}
{"comments": [{"comment": "Dear, i check nobody don't have", "username": "hafidulazadt", "commentId": "comment-7416721"}, {"comment": "Oh for goodness sake.. Why not google first .. http://www.qatarliving.com/cars-0/posts/plasti-dip-where-get-it", "username": "britexpat", "commentId": "comment-7416706"}, {"comment": "i need plasti dip.", "username": "hafidulazadt", "commentId": "comment-7416536"}, {"comment": "Yes we have it at NanoFilm", "username": "Honza", "commentId": "comment-7416521"}, {"comment": "plasti dip like film coating. that we can easily remove after few months", "username": "hafidulazadt", "commentId": "comment-7416371"}, {"comment": "What do you need it for hafid .. Perhaps there is something else you can use", "username": "muad-db", "commentId": "comment-7416361"}], "question": "Dear, Plasti Dip (Rubber Coating Aerosol) its available in Doha? how much the price? thank", "username": "hafidulazadt"}
